ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/AM263X/MSS_RCM_MSS_RCM_53208000h.xml
<module name="MSS_RCM" acronym="" XML_version="1.0" HW_revision="n/a" description="">
	<register id="MSS_RCM_R5SS0_RST_STATUS" acronym="MSS_RCM_R5SS0_RST_STATUS" offset="16" width="32" description="R5SS Reset Cause Status register of corresponding R5SS.">
		<bitfield id="R5SS0_RST_STATUS_CAUSE" width="11" begin="10" end="0" resetval="0x3" description="Has the status because of which reset has happened.  Bit0: POR ResetBit1: Warm Reset [ALso set during POR Reset]Bit2: CR5SS0 STC ResetBit3  Reset for CORE0 and MSS_CORE00_VIM  using MSS_RCM::MSS_CR5SSA0_RST_CTRLBit4: Reset for CORE1 and MSS_CORE10_VIM using MSS_RCM::MSS_CR5SSB0_RST_CTRLBit5: Reset for  CORE0 only using  MSS_RCM::MSS_CORE00_RST_CTRLBit6: Reset for CORE1 only using using MSS_RCM::MSS_CORE10_RST_CTRLBit7: Reset for CORE0 and MSS_CORE00_VIM caused because of reset request  by debugger in CORE00                                                                                                       Bit8:  Reset for CORE10 and MSS_CORE10_VIM caused because of reset request  by debugger in CORE10Bit9: Reset for CR5SS0 by the RESET FSM  using MSS_CTRL::R5SS0_CONTROL_RESET_FSM_TRIGGER        Bit10 : Reset for CR5SS0 using MSS_RCM.MSS_CR5SS_POR_RST_CTRL0" range="10:0" rwaccess="R"/>
	</register><register id="MSS_RCM_R5SS0_RST_CAUSE_CLR" acronym="MSS_RCM_R5SS0_RST_CAUSE_CLR" offset="20" width="32" description="R5SS Reset Cause Clear register of corresponding R5SS.">
		<bitfield id="R5SS0_RST_CAUSE_CLR_CLR" width="3" begin="2" end="0" resetval="0x0" description="Write pulse bit field:Clear bit for rst cause register [Writing 3'b111  will clear the rst cause register]" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_SYSRST_BY_DBG_RST0" acronym="MSS_RCM_SYSRST_BY_DBG_RST0" offset="24" width="32" description="This register enables Core debug reset request  to propogate to RCM.">
		<bitfield id="SYSRST_BY_DBG_RST0_R5B" width="3" begin="18" end="16" resetval="0x0" description="Writing 3'b111   will block debug reset request from CORE1  toggling reset for CORE1 of respective R5SS" range="18:16" rwaccess="R/W"/>
	<bitfield id="SYSRST_BY_DBG_RST0_R5A" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111   will block debug reset request from CORE0  toggling reset for CORE0 of respective R5SS" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_RST_ASSERDLY0" acronym="MSS_RCM_RST_ASSERDLY0" offset="28" width="32" description="This register controls the reset duration of the corrseponding R5SS.">
		<bitfield id="RST_ASSERDLY0_COMMON" width="8" begin="7" end="0" resetval="0x15" description="Value decides number of cycles reset should be kept asserted for CR5SS related resets. Programming a value of 0xFF will keep the reset asserted untill a new value other than 0xFF is written to this registerThe actual duration is count + 2 cycles. S/W Recommended value for this is 0x0FThe COUNT is applicable to both CPU cores" range="7:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_RST2ASSERTDLY0" acronym="MSS_RCM_RST2ASSERTDLY0" offset="32" width="32" description="This register controls the delay of Reset assertion to the corresponding R5SS.">
		<bitfield id="RST2ASSERTDLY0_R5B" width="8" begin="31" end="24" resetval="0x0" description="Value decides number of cycles to wait before asserting reset for local reset for CORE1" range="31:24" rwaccess="R/W"/>
	<bitfield id="RST2ASSERTDLY0_R5A" width="8" begin="23" end="16" resetval="0x0" description="Value decides number of cycles to wait before asserting reset for local reset for CORE0." range="23:16" rwaccess="R/W"/>
	<bitfield id="RST2ASSERTDLY0_R5SSB" width="8" begin="15" end="8" resetval="0x0" description="Value decides number of cycles to wait before asserting reset for global reset for CORE1" range="15:8" rwaccess="R/W"/>
	<bitfield id="RST2ASSERTDLY0_R5SSA" width="8" begin="7" end="0" resetval="0x0" description="Value decides number of cycles to wait before asserting reset for global reset for CORE0." range="7:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_RST_WFICHECK0" acronym="MSS_RCM_RST_WFICHECK0" offset="36" width="32" description="Enable WFI check before R5 Reset is asserted.">
		<bitfield id="RST_WFICHECK0_R5B" width="3" begin="26" end="24" resetval="0x7" description="Writing 3'b000 will disable check for WFI before  local reset assertion of Cluster0 CORE1" range="26:24" rwaccess="R/W"/>
	<bitfield id="RST_WFICHECK0_R5A" width="3" begin="18" end="16" resetval="0x7" description="Writing 3'b000 will disable check for WFI before  local reset assertion of Cluster0 CORE0" range="18:16" rwaccess="R/W"/>
	<bitfield id="RST_WFICHECK0_R5SSB" width="3" begin="10" end="8" resetval="0x7" description="Writing 3'b000 will disable check for WFI before  global reset assertion of Cluster0 CORE1" range="10:8" rwaccess="R/W"/>
	<bitfield id="RST_WFICHECK0_R5SSA" width="3" begin="2" end="0" resetval="0x7" description="Writing 3'b000 will disable check for WFI before  global reset assertion of Cluster0 CORE0" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_R5SS1_RST_STATUS" acronym="MSS_RCM_R5SS1_RST_STATUS" offset="48" width="32" description="R5SS Reset Cause Status register of corresponding R5SS.">
		<bitfield id="R5SS1_RST_STATUS_CAUSE" width="11" begin="10" end="0" resetval="0x3" description="Has the status because of which reset has happened.  Bit0: POR ResetBit1: Warm Reset [ALso set during POR Reset]Bit2: CR5SS1 STC ResetBit3  Reset for CORE0 and MSS_CORE00_VIM  using MSS_RCM::MSS_CR5SSA0_RST_CTRLBit4: Reset for CORE1 and MSS_CORE10_VIM using MSS_RCM::MSS_CR5SSB0_RST_CTRLBit5: Reset for  CORE0 only using  MSS_RCM::MSS_CORE00_RST_CTRLBit6: Reset for CORE1 only using using MSS_RCM::MSS_CORE10_RST_CTRLBit7: Reset for CORE0 and MSS_CORE00_VIM caused because of reset request  by debugger in CORE00                                                                                                       Bit8:  Reset for CORE10 and MSS_CORE10_VIM caused because of reset request  by debugger in CORE10Bit9: Reset for CR5SS0 by the RESET FSM  using MSS_CTRL::R5SS0_CONTROL_RESET_FSM_TRIGGER        Bit10 : Reset for CR5SS1 using MSS_RCM.MSS_CR5SS_POR_RST_CTRL0" range="10:0" rwaccess="R"/>
	</register><register id="MSS_RCM_R5SS1_RST_CAUSE_CLR" acronym="MSS_RCM_R5SS1_RST_CAUSE_CLR" offset="52" width="32" description="R5SS Reset Cause Clear register of corresponding R5SS.">
		<bitfield id="R5SS1_RST_CAUSE_CLR_CLR" width="3" begin="2" end="0" resetval="0x0" description="Write pulse bit field:Clear bit for rst cause register [Writing 3'b111  will clear the rst cause register]" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_SYSRST_BY_DBG_RST1" acronym="MSS_RCM_SYSRST_BY_DBG_RST1" offset="56" width="32" description="This register enables Core debug reset request  to propogate to RCM.">
		<bitfield id="SYSRST_BY_DBG_RST1_R5B" width="3" begin="18" end="16" resetval="0x0" description="Writing 3'b111   will block debug reset request from CORE1  toggling reset for CORE1 of respective R5SS" range="18:16" rwaccess="R/W"/>
	<bitfield id="SYSRST_BY_DBG_RST1_R5A" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111   will block debug reset request from CORE0  toggling reset for CORE0 of respective R5SS" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_RST_ASSERDLY1" acronym="MSS_RCM_RST_ASSERDLY1" offset="60" width="32" description="This register controls the reset duration of the corrseponding R5SS.">
		<bitfield id="RST_ASSERDLY1_COMMON" width="8" begin="7" end="0" resetval="0x15" description="Value decides number of cycles reset should be kept asserted for CR5SS related resets. Programming a value of 0xFF will keep the reset asserted untill a new value other than 0xFF is written to this registerThe actual duration is count + 2 cycles. S/W Recommended value for this is 0x0FThe COUNT is applicable to both CPU cores" range="7:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_RST2ASSERTDLY1" acronym="MSS_RCM_RST2ASSERTDLY1" offset="64" width="32" description="This register controls the delay of Reset assertion to the corresponding R5SS.">
		<bitfield id="RST2ASSERTDLY1_R5B" width="8" begin="31" end="24" resetval="0x0" description="Value decides number of cycles to wait before asserting reset for local reset for CORE1" range="31:24" rwaccess="R/W"/>
	<bitfield id="RST2ASSERTDLY1_R5A" width="8" begin="23" end="16" resetval="0x0" description="Value decides number of cycles to wait before asserting reset for local reset for CORE0." range="23:16" rwaccess="R/W"/>
	<bitfield id="RST2ASSERTDLY1_R5SSB" width="8" begin="15" end="8" resetval="0x0" description="Value decides number of cycles to wait before asserting reset for global reset for CORE1" range="15:8" rwaccess="R/W"/>
	<bitfield id="RST2ASSERTDLY1_R5SSA" width="8" begin="7" end="0" resetval="0x0" description="Value decides number of cycles to wait before asserting reset for global reset for CORE0." range="7:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_RST_WFICHECK1" acronym="MSS_RCM_RST_WFICHECK1" offset="68" width="32" description="Enable WFI check before R5 Reset is asserted.">
		<bitfield id="RST_WFICHECK1_R5B" width="3" begin="26" end="24" resetval="0x7" description="Writing 3'b000 will disable check for WFI before  local reset assertion of Cluster1 CORE1" range="26:24" rwaccess="R/W"/>
	<bitfield id="RST_WFICHECK1_R5A" width="3" begin="18" end="16" resetval="0x7" description="Writing 3'b000 will disable check for WFI before  local reset assertion of Cluster1 CORE0" range="18:16" rwaccess="R/W"/>
	<bitfield id="RST_WFICHECK1_R5SSB" width="3" begin="10" end="8" resetval="0x7" description="Writing 3'b000 will disable check for WFI before  global reset assertion of Cluster1 CORE1" range="10:8" rwaccess="R/W"/>
	<bitfield id="RST_WFICHECK1_R5SSA" width="3" begin="2" end="0" resetval="0x7" description="Writing 3'b000 will disable check for WFI before  global reset assertion of Cluster1 CORE0" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MSS_MCAN0_CLK_SRC_SEL" acronym="MSS_RCM_MSS_MCAN0_CLK_SRC_SEL" offset="256" width="32" description="This Register is used for selecting the clock source for Corresponding root clock.">
		<bitfield id="MSS_MCAN0_CLK_SRC_SEL_CLKSRCSEL" width="12" begin="11" end="0" resetval="0x0" description="Select line for selecting source clock for corresponding MCAN.Data should be loaded as multibit.  For example: if '0x5' should be selected then '0x555' should be       configured to the register.Use the following values for selecting clock source-0x000 - WUCPUCLK0x111 - EXT_REFCLK0x222 - SYS_CLK0x333 - DPLL_PER_HSDIV0_CLKOUT10x444 - DPLL_CORE_HSDIV0_CLKOUT00x555 - RCCLK10M0x666 - XTALCLK0x777 - RCCLK10M" range="11:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MSS_MCAN1_CLK_SRC_SEL" acronym="MSS_RCM_MSS_MCAN1_CLK_SRC_SEL" offset="260" width="32" description="Clock Source selection Register for corresponding Root clock.">
		<bitfield id="MSS_MCAN1_CLK_SRC_SEL_CLKSRCSEL" width="12" begin="11" end="0" resetval="0x0" description="Select line for selecting source clock for corresponding MCAN.Data should be loaded as multibit.  For example: if '0x5' should be selected then '0x555' should be       configured to the register.Use the following values for selecting clock source-0x000 - WUCPUCLK0x111 - EXT_REFCLK0x222 - SYS_CLK0x333 - DPLL_PER_HSDIV0_CLKOUT10x444 - DPLL_CORE_HSDIV0_CLKOUT00x555 - RCCLK10M0x666 - XTALCLK0x777 - RCCLK10M" range="11:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MSS_MCAN2_CLK_SRC_SEL" acronym="MSS_RCM_MSS_MCAN2_CLK_SRC_SEL" offset="264" width="32" description="Clock Source selection Register for corresponding Root clock.">
		<bitfield id="MSS_MCAN2_CLK_SRC_SEL_CLKSRCSEL" width="12" begin="11" end="0" resetval="0x0" description="Select line for selecting source clock for corresponding MCAN.Data should be loaded as multibit.  For example: if '0x5' should be selected then '0x555' should be       configured to the register.Use the following values for selecting clock source-0x000 - WUCPUCLK0x111 - EXT_REFCLK0x222 - SYS_CLK0x333 - DPLL_PER_HSDIV0_CLKOUT10x444 - DPLL_CORE_HSDIV0_CLKOUT00x555 - RCCLK10M0x666 - XTALCLK0x777 - RCCLK10M" range="11:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MSS_MCAN3_CLK_SRC_SEL" acronym="MSS_RCM_MSS_MCAN3_CLK_SRC_SEL" offset="268" width="32" description="Clock Source selection Register for corresponding Root clock.">
		<bitfield id="MSS_MCAN3_CLK_SRC_SEL_CLKSRCSEL" width="12" begin="11" end="0" resetval="0x0" description="Select line for selecting source clock for corresponding MCAN.Data should be loaded as multibit.  For example: if '0x5' should be selected then '0x555' should be       configured to the register.Use the following values for selecting clock source-0x000 - WUCPUCLK0x111 - EXT_REFCLK0x222 - SYS_CLK0x333 - DPLL_PER_HSDIV0_CLKOUT10x444 - DPLL_CORE_HSDIV0_CLKOUT00x555 - RCCLK10M0x666 - XTALCLK0x777 - RCCLK10M" range="11:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MSS_QSPI_CLK_SRC_SEL" acronym="MSS_RCM_MSS_QSPI_CLK_SRC_SEL" offset="272" width="32" description="Clock Source selection Register for corresponding Root clock.">
		<bitfield id="MSS_QSPI_CLK_SRC_SEL_CLKSRCSEL" width="12" begin="11" end="0" resetval="0x0" description="Select line for selecting source clock for QSPI.Data should be loaded as multibit.  For example: if '0x5' should be selected then '0x555' should be       configured to the register. Use the following values for selecting clock source-0x000 -  WUCPUCLK0x111 -  EXT_REFCLK0x222 -  SYS_CLK0x333 -  DPLL_PER_HSDIV0_CLKOUT10x444 -  DPLL_CORE_HSDIV0_CLKOUT00x555 -  RCCLK10M0x666 -  XTALCLK0x777 -  RCCLK10M" range="11:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MSS_RTI0_CLK_SRC_SEL" acronym="MSS_RCM_MSS_RTI0_CLK_SRC_SEL" offset="276" width="32" description="This Register is used for selecting the clock source for Corresponding root clock.">
		<bitfield id="MSS_RTI0_CLK_SRC_SEL_CLKSRCSEL" width="12" begin="11" end="0" resetval="0x0" description="Select line for selecting source clock for Corresponding RTI.Data should be loaded as multibit.  For example: if '0x5' should be selected then '0x555' should be       configured to the register. Use the following values to select clk src-      0x000 -  WUCPUCLK0x111 -  EXT_REFCLK0x222 -  SYS_CLK0x333 -  DPLL_PER_HSDIV0_CLKOUT10x444 -  DPLL_CORE_HSDIV0_CLKOUT10x555 -  RCCLK10M0x666 -  XTALCLK0x777 -  CTPS_GENF0" range="11:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MSS_RTI1_CLK_SRC_SEL" acronym="MSS_RCM_MSS_RTI1_CLK_SRC_SEL" offset="280" width="32" description="This Register is used for selecting the clock source for Corresponding root clock.">
		<bitfield id="MSS_RTI1_CLK_SRC_SEL_CLKSRCSEL" width="12" begin="11" end="0" resetval="0x0" description="Select line for selecting source clock for Corresponding RTI.Data should be loaded as multibit.  For example: if '0x5' should be selected then '0x555' should be       configured to the register. Use the following values to select clk src-      0x000 -  WUCPUCLK0x111 -  EXT_REFCLK0x222 -  SYS_CLK0x333 -  DPLL_PER_HSDIV0_CLKOUT10x444 -  DPLL_CORE_HSDIV0_CLKOUT10x555 -  RCCLK10M0x666 -  XTALCLK0x777 -  CTPS_GENF0" range="11:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MSS_RTI2_CLK_SRC_SEL" acronym="MSS_RCM_MSS_RTI2_CLK_SRC_SEL" offset="284" width="32" description="This Register is used for selecting the clock source for Corresponding root clock.">
		<bitfield id="MSS_RTI2_CLK_SRC_SEL_CLKSRCSEL" width="12" begin="11" end="0" resetval="0x0" description="Select line for selecting source clock for Corresponding RTI.Data should be loaded as multibit.  For example: if '0x5' should be selected then '0x555' should be       configured to the register. Use the following values to select clk src-      0x000 -  WUCPUCLK0x111 -  EXT_REFCLK0x222 -  SYS_CLK0x333 -  DPLL_PER_HSDIV0_CLKOUT10x444 -  DPLL_CORE_HSDIV0_CLKOUT10x555 -  RCCLK10M0x666 -  XTALCLK0x777 -  CTPS_GENF0" range="11:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MSS_RTI3_CLK_SRC_SEL" acronym="MSS_RCM_MSS_RTI3_CLK_SRC_SEL" offset="288" width="32" description="This Register is used for selecting the clock source for Corresponding root clock.">
		<bitfield id="MSS_RTI3_CLK_SRC_SEL_CLKSRCSEL" width="12" begin="11" end="0" resetval="0x0" description="Select line for selecting source clock for Corresponding RTI.Data should be loaded as multibit.  For example: if '0x5' should be selected then '0x555' should be       configured to the register. Use the following values to select clk src-      0x000 -  WUCPUCLK0x111 -  EXT_REFCLK0x222 -  SYS_CLK0x333 -  DPLL_PER_HSDIV0_CLKOUT10x444 -  DPLL_CORE_HSDIV0_CLKOUT10x555 -  RCCLK10M0x666 -  XTALCLK0x777 -  CTPS_GENF0" range="11:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MSS_WDT0_CLK_SRC_SEL" acronym="MSS_RCM_MSS_WDT0_CLK_SRC_SEL" offset="296" width="32" description="This Register is used for selecting the clock source for Corresponding root clock.">
		<bitfield id="MSS_WDT0_CLK_SRC_SEL_CLKSRCSEL" width="12" begin="11" end="0" resetval="0x0" description="Select line for selecting source clock for WDT.Data should be loaded as multibit.  For example: if '0x5' should be selected then '0x555' should be       configured to the register.Use the following values to select clk src-0x000 -  WUCPUCLK0x111 -  RCCLK10M0x222 -  SYS_CLK0x333 -  DPLL_PER_HSDIV0_CLKOUT10x444 -  DPLL_CORE_HSDIV0_CLKOUT10x555 -  RCCLK10M0x666 -  XTALCLK0x777 -  RCCLK32K" range="11:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MSS_WDT1_CLK_SRC_SEL" acronym="MSS_RCM_MSS_WDT1_CLK_SRC_SEL" offset="300" width="32" description="This Register is used for selecting the clock source for Corresponding root clock.">
		<bitfield id="MSS_WDT1_CLK_SRC_SEL_CLKSRCSEL" width="12" begin="11" end="0" resetval="0x0" description="Select line for selecting source clock for WDT.Data should be loaded as multibit.  For example: if '0x5' should be selected then '0x555' should be       configured to the register.Use the following values to select clk src-0x000 -  WUCPUCLK0x111 -  RCCLK10M0x222 -  SYS_CLK0x333 -  DPLL_PER_HSDIV0_CLKOUT10x444 -  DPLL_CORE_HSDIV0_CLKOUT10x555 -  RCCLK10M0x666 -  XTALCLK0x777 -  RCCLK32K" range="11:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MSS_WDT2_CLK_SRC_SEL" acronym="MSS_RCM_MSS_WDT2_CLK_SRC_SEL" offset="304" width="32" description="This Register is used for selecting the clock source for Corresponding root clock.">
		<bitfield id="MSS_WDT2_CLK_SRC_SEL_CLKSRCSEL" width="12" begin="11" end="0" resetval="0x0" description="Select line for selecting source clock for WDT.Data should be loaded as multibit.  For example: if '0x5' should be selected then '0x555' should be       configured to the register.Use the following values to select clk src-0x000 -  WUCPUCLK0x111 -  RCCLK10M0x222 -  SYS_CLK0x333 -  DPLL_PER_HSDIV0_CLKOUT10x444 -  DPLL_CORE_HSDIV0_CLKOUT10x555 -  RCCLK10M0x666 -  XTALCLK0x777 -  RCCLK32K" range="11:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MSS_WDT3_CLK_SRC_SEL" acronym="MSS_RCM_MSS_WDT3_CLK_SRC_SEL" offset="308" width="32" description="This Register is used for selecting the clock source for Corresponding root clock.">
		<bitfield id="MSS_WDT3_CLK_SRC_SEL_CLKSRCSEL" width="12" begin="11" end="0" resetval="0x0" description="Select line for selecting source clock for WDT.Data should be loaded as multibit.  For example: if '0x5' should be selected then '0x555' should be       configured to the register.Use the following values to select clk src-0x000 -  WUCPUCLK0x111 -  RCCLK10M0x222 -  SYS_CLK0x333 -  DPLL_PER_HSDIV0_CLKOUT10x444 -  DPLL_CORE_HSDIV0_CLKOUT10x555 -  RCCLK10M0x666 -  XTALCLK0x777 -  RCCLK32K" range="11:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MSS_SPI0_CLK_SRC_SEL" acronym="MSS_RCM_MSS_SPI0_CLK_SRC_SEL" offset="316" width="32" description="This Register is used for selecting the clock source for Corresponding root clock.">
		<bitfield id="MSS_SPI0_CLK_SRC_SEL_CLKSRCSEL" width="12" begin="11" end="0" resetval="0x0" description="Select line for selecting source clock for Corresponding SPI.Data should be loaded as multibit.  For example: if '0x5' should be selected then '0x555' should be       configured to the register.Use the following values to select clk src-0x000 -  WUCPUCLK0x111 -  EXT_REFCLK0x222 -  SYS_CLK0x333 -  DPLL_PER_HSDIV0_CLKOUT10x444 -  DPLL_CORE_HSDIV0_CLKOUT00x555 -  RCCLK10M0x666 -  XTALCLK0x777 -  RCCLK10M" range="11:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MSS_SPI1_CLK_SRC_SEL" acronym="MSS_RCM_MSS_SPI1_CLK_SRC_SEL" offset="320" width="32" description="This Register is used for selecting the clock source for Corresponding root clock.">
		<bitfield id="MSS_SPI1_CLK_SRC_SEL_CLKSRCSEL" width="12" begin="11" end="0" resetval="0x0" description="Select line for selecting source clock for Corresponding SPI.Data should be loaded as multibit.  For example: if '0x5' should be selected then '0x555' should be       configured to the register.Use the following values to select clk src-0x000 -  WUCPUCLK0x111 -  EXT_REFCLK0x222 -  SYS_CLK0x333 -  DPLL_PER_HSDIV0_CLKOUT10x444 -  DPLL_CORE_HSDIV0_CLKOUT00x555 -  RCCLK10M0x666 -  XTALCLK0x777 -  RCCLK10M" range="11:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MSS_SPI2_CLK_SRC_SEL" acronym="MSS_RCM_MSS_SPI2_CLK_SRC_SEL" offset="324" width="32" description="This Register is used for selecting the clock source for Corresponding root clock.">
		<bitfield id="MSS_SPI2_CLK_SRC_SEL_CLKSRCSEL" width="12" begin="11" end="0" resetval="0x0" description="Select line for selecting source clock for Corresponding SPI.Data should be loaded as multibit.  For example: if '0x5' should be selected then '0x555' should be       configured to the register.Use the following values to select clk src-0x000 -  WUCPUCLK0x111 -  EXT_REFCLK0x222 -  SYS_CLK0x333 -  DPLL_PER_HSDIV0_CLKOUT10x444 -  DPLL_CORE_HSDIV0_CLKOUT00x555 -  RCCLK10M0x666 -  XTALCLK0x777 -  RCCLK10M" range="11:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MSS_SPI3_CLK_SRC_SEL" acronym="MSS_RCM_MSS_SPI3_CLK_SRC_SEL" offset="328" width="32" description="This Register is used for selecting the clock source for Corresponding root clock.">
		<bitfield id="MSS_SPI3_CLK_SRC_SEL_CLKSRCSEL" width="12" begin="11" end="0" resetval="0x0" description="Select line for selecting source clock for Corresponding SPI.Data should be loaded as multibit.  For example: if '0x5' should be selected then '0x555' should be       configured to the register.Use the following values to select clk src-0x000 -  WUCPUCLK0x111 -  EXT_REFCLK0x222 -  SYS_CLK0x333 -  DPLL_PER_HSDIV0_CLKOUT10x444 -  DPLL_CORE_HSDIV0_CLKOUT00x555 -  RCCLK10M0x666 -  XTALCLK0x777 -  RCCLK10M" range="11:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MSS_SPI4_CLK_SRC_SEL" acronym="MSS_RCM_MSS_SPI4_CLK_SRC_SEL" offset="332" width="32" description="This Register is used for selecting the clock source for Corresponding root clock.">
		<bitfield id="MSS_SPI4_CLK_SRC_SEL_CLKSRCSEL" width="12" begin="11" end="0" resetval="0x0" description="Select line for selecting source clock for Corresponding SPI.Data should be loaded as multibit.  For example: if '0x5' should be selected then '0x555' should be       configured to the register.Use the following values to select clk src-0x000 -  WUCPUCLK0x111 -  EXT_REFCLK0x222 -  SYS_CLK0x333 -  DPLL_PER_HSDIV0_CLKOUT10x444 -  DPLL_CORE_HSDIV0_CLKOUT00x555 -  RCCLK10M0x666 -  XTALCLK0x777 -  RCCLK10M" range="11:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MSS_MMCSD_CLK_SRC_SEL" acronym="MSS_RCM_MSS_MMCSD_CLK_SRC_SEL" offset="336" width="32" description="This Register is used for selecting the clock source for Corresponding root clock.">
