ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/AM263X/MSS_RCM_MSS_RCM_53208000h.xml
		<bitfield id="MSS_MMCSD_CLK_SRC_SEL_CLKSRCSEL" width="12" begin="11" end="0" resetval="0x0" description="Select line for selecting source clock for MMCSD.Data should be loaded as multibit.  For example: if '0x5' should be selected then '0x555' should be       configured to the register.Use the following values to select clk src-0x000 -  WUCPUCLK0x111 -  EXT_REFCLK0x222 -  SYS_CLK0x333 -  DPLL_PER_HSDIV0_CLKOUT10x444 -  DPLL_CORE_HSDIV0_CLKOUT00x555 -  RCCLK10M0x666 -  XTALCLK0x777 -  RCCLK10M" range="11:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_PRU_ICSS_UCLK_CLK_SRC_SEL" acronym="MSS_RCM_PRU_ICSS_UCLK_CLK_SRC_SEL" offset="340" width="32" description="This Register is used for selecting the clock source for Corresponding root clock.">
		<bitfield id="PRU_ICSS_UCLK_CLK_SRC_SEL_CLKSRCSEL" width="12" begin="11" end="0" resetval="0x0" description="Select line for selecting source clock for ICSSM_UCLK.Data should be loaded as multibit.  For example: if '0x5' should be selected then '0x555' should be       configured to the register.Use the following values to select clk src-0x000 -  WUCPUCLK0x111 -  EXT_REFCLK0x222 -  SYS_CLK0x333 -  DPLL_PER_HSDIV0_CLKOUT10x444 -  DPLL_CORE_HSDIV0_CLKOUT00x555 -  RCCLK10M0x666 -  XTALCLK0x777 -  DPLL_PER_HSDIV0_CLKOUT0" range="11:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MSS_CPTS_CLK_SRC_SEL" acronym="MSS_RCM_MSS_CPTS_CLK_SRC_SEL" offset="344" width="32" description="This Register is used for selecting the clock source for Corresponding root clock.">
		<bitfield id="MSS_CPTS_CLK_SRC_SEL_CLKSRCSEL" width="12" begin="11" end="0" resetval="0x0" description="Select line for selecting source clock for CPTS.Data should be loaded as multibit.  For example: if '0x5' should be selected then '0x555' should be       configured to the register.Use the following values to select clk src-0x000 -  WUCPUCLK0x111 -  EXT_REFCLK0x222 -  SYS_CLK0x333 -  DPLL_CORE_HSDIV0_CLKOUT10x444 -  DPLL_CORE_HSDIV0_CLKOUT00x555 -  RCCLK10M0x666 -  XTALCLK0x777 -  RCCLK10M" range="11:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_GPMC_CLK_SRC_SEL" acronym="MSS_RCM_GPMC_CLK_SRC_SEL" offset="348" width="32" description="This Register is used for selecting the clock source for Corresponding root clock.">
		<bitfield id="GPMC_CLK_SRC_SEL_CLKSRCSEL" width="12" begin="11" end="0" resetval="0x0" description="Select line for selecting source clock for GPMC. Data should be loaded as multibit.  For example: if '0x5' should be selected then '0x555' should be       configured to the register.Use the following values to select clk src-0x000 -  WUCPUCLK0x111 -  EXT_REFCLK0x222 -  SYS_CLK0x333 -  DPLL_PER_HSDIV0_CLKOUT10x444 -  DPLL_CORE_HSDIV0_CLKOUT00x555 -  RCCLK10M0x666 -  XTALCLK0x777 -  RCCLK10M" range="11:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_CONTROLSS_PLL_CLK_SRC_SEL" acronym="MSS_RCM_CONTROLSS_PLL_CLK_SRC_SEL" offset="352" width="32" description="This Register is used for selecting the clock source for Corresponding root clock.">
		<bitfield id="CONTROLSS_PLL_CLK_SRC_SEL_CLKSRCSEL" width="12" begin="11" end="0" resetval="0x0" description="Select line for selecting source clock for CONTROLSS_PLL.Data should be loaded as multibit.  For example: if '0x5' should be selected then '0x555' should be       configured to the register.Use the following values to select clk src-0x000 -  WUCPUCLK0x111 -  EXT_REFCLK0x222 -  DPLL_CORE_HSDIV0_CLKOUT20x333 -  DPLL_PER_HSDIV0_CLKOUT10x444 -  DPLL_CORE_HSDIV0_CLKOUT00x555 -  RCCLK10M0x666 -  XTALCLK0x777 -  RCCLK10M" range="11:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MSS_I2C_CLK_SRC_SEL" acronym="MSS_RCM_MSS_I2C_CLK_SRC_SEL" offset="356" width="32" description="This Register is used for selecting the clock source for Corresponding root clock.">
		<bitfield id="MSS_I2C_CLK_SRC_SEL_CLKSRCSEL" width="12" begin="11" end="0" resetval="0x0" description="Select line for selecting source clock for I2C.Data should be loaded as multibit.  For example: if '0x5' should be selected then '0x555' should be       configured to the register.Use the following values to select clk src-0x000 -  WUCPUCLK0x111 -  EXT_REFCLK0x222 -  SYS_CLK0x333 -  DPLL_PER_HSDIV0_CLKOUT10x444 -  DPLL_CORE_HSDIV0_CLKOUT00x555 -  RCCLK10M0x666 -  XTALCLK0x777 -  RCCLK10M" range="11:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MSS_LIN0_UART0_CLK_SRC_SEL" acronym="MSS_RCM_MSS_LIN0_UART0_CLK_SRC_SEL" offset="372" width="32" description="This Register is used for selecting the clock source for Corresponding root clock.">
		<bitfield id="MSS_LIN0_UART0_CLK_SRC_SEL_CLKSRCSEL" width="12" begin="11" end="0" resetval="0x0" description="Select line for selecting source clock for corresponding UART and LIN.Data should be loaded as multibit.  For example: if '0x5' should be selected then '0x555' should be       configured to the register.Use the following values to select clk src-0x000 -  WUCPUCLK0x111 -  EXT_REFCLK0x222 -  SYS_CLK0x333 -  DPLL_PER_HSDIV0_CLKOUT10x444 -  DPLL_CORE_HSDIV0_CLKOUT00x555 -  RCCLK10M0x666 -  XTALCLK0x777 -  DPLL_PER_HSDIV0_CLKOUT0" range="11:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MSS_LIN1_UART1_CLK_SRC_SEL" acronym="MSS_RCM_MSS_LIN1_UART1_CLK_SRC_SEL" offset="376" width="32" description="This Register is used for selecting the clock source for Corresponding root clock.">
		<bitfield id="MSS_LIN1_UART1_CLK_SRC_SEL_CLKSRCSEL" width="12" begin="11" end="0" resetval="0x0" description="Select line for selecting source clock for corresponding UART and LIN.Data should be loaded as multibit.  For example: if '0x5' should be selected then '0x555' should be       configured to the register.Use the following values to select clk src-0x000 -  WUCPUCLK0x111 -  EXT_REFCLK0x222 -  SYS_CLK0x333 -  DPLL_PER_HSDIV0_CLKOUT10x444 -  DPLL_CORE_HSDIV0_CLKOUT00x555 -  RCCLK10M0x666 -  XTALCLK0x777 -  DPLL_PER_HSDIV0_CLKOUT0" range="11:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MSS_LIN2_UART2_CLK_SRC_SEL" acronym="MSS_RCM_MSS_LIN2_UART2_CLK_SRC_SEL" offset="380" width="32" description="This Register is used for selecting the clock source for Corresponding root clock.">
		<bitfield id="MSS_LIN2_UART2_CLK_SRC_SEL_CLKSRCSEL" width="12" begin="11" end="0" resetval="0x0" description="Select line for selecting source clock for corresponding UART and LIN.Data should be loaded as multibit.  For example: if '0x5' should be selected then '0x555' should be       configured to the register.Use the following values to select clk src-0x000 -  WUCPUCLK0x111 -  EXT_REFCLK0x222 -  SYS_CLK0x333 -  DPLL_PER_HSDIV0_CLKOUT10x444 -  DPLL_CORE_HSDIV0_CLKOUT00x555 -  RCCLK10M0x666 -  XTALCLK0x777 -  DPLL_PER_HSDIV0_CLKOUT0" range="11:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MSS_LIN3_UART3_CLK_SRC_SEL" acronym="MSS_RCM_MSS_LIN3_UART3_CLK_SRC_SEL" offset="384" width="32" description="This Register is used for selecting the clock source for Corresponding root clock.">
		<bitfield id="MSS_LIN3_UART3_CLK_SRC_SEL_CLKSRCSEL" width="12" begin="11" end="0" resetval="0x0" description="Select line for selecting source clock for corresponding UART and LIN.Data should be loaded as multibit.  For example: if '0x5' should be selected then '0x555' should be       configured to the register.Use the following values to select clk src-0x000 -  WUCPUCLK0x111 -  EXT_REFCLK0x222 -  SYS_CLK0x333 -  DPLL_PER_HSDIV0_CLKOUT10x444 -  DPLL_CORE_HSDIV0_CLKOUT00x555 -  RCCLK10M0x666 -  XTALCLK0x777 -  DPLL_PER_HSDIV0_CLKOUT0" range="11:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MSS_LIN4_UART4_CLK_SRC_SEL" acronym="MSS_RCM_MSS_LIN4_UART4_CLK_SRC_SEL" offset="388" width="32" description="This Register is used for selecting the clock source for Corresponding root clock.">
		<bitfield id="MSS_LIN4_UART4_CLK_SRC_SEL_CLKSRCSEL" width="12" begin="11" end="0" resetval="0x0" description="Select line for selecting source clock for corresponding UART and LIN.Data should be loaded as multibit.  For example: if '0x5' should be selected then '0x555' should be       configured to the register.Use the following values to select clk src-0x000 -  WUCPUCLK0x111 -  EXT_REFCLK0x222 -  SYS_CLK0x333 -  DPLL_PER_HSDIV0_CLKOUT10x444 -  DPLL_CORE_HSDIV0_CLKOUT00x555 -  RCCLK10M0x666 -  XTALCLK0x777 -  DPLL_PER_HSDIV0_CLKOUT0" range="11:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MSS_LIN5_UART5_CLK_SRC_SEL" acronym="MSS_RCM_MSS_LIN5_UART5_CLK_SRC_SEL" offset="392" width="32" description="This Register is used for selecting the clock source for Corresponding root clock.">
		<bitfield id="MSS_LIN5_UART5_CLK_SRC_SEL_CLKSRCSEL" width="12" begin="11" end="0" resetval="0x0" description="Select line for selecting source clock for corresponding UART and LIN.Data should be loaded as multibit.  For example: if '0x5' should be selected then '0x555' should be       configured to the register.Use the following values to select clk src-0x000 -  WUCPUCLK0x111 -  EXT_REFCLK0x222 -  SYS_CLK0x333 -  DPLL_PER_HSDIV0_CLKOUT10x444 -  DPLL_CORE_HSDIV0_CLKOUT00x555 -  RCCLK10M0x666 -  XTALCLK0x777 -  DPLL_PER_HSDIV0_CLKOUT0" range="11:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MSS_MCAN0_CLK_DIV_VAL" acronym="MSS_RCM_MSS_MCAN0_CLK_DIV_VAL" offset="512" width="32" description="This Register is used for selecting the clock source for Corresponding root clock.">
		<bitfield id="MSS_MCAN0_CLK_DIV_VAL_CLKDIVR" width="12" begin="11" end="0" resetval="0x0" description="Divider value corresponding MCAN selected clock.To set the divider value of [n+1] configure the register to value of '0xnnn'.Data should be loaded as multibit.  For example:  if divider value of '0x9' is required then '0x888' should be configured to the register." range="11:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MSS_MCAN1_CLK_DIV_VAL" acronym="MSS_RCM_MSS_MCAN1_CLK_DIV_VAL" offset="516" width="32" description="This Register is used to select the Divider value for respective clk.">
		<bitfield id="MSS_MCAN1_CLK_DIV_VAL_CLKDIVR" width="12" begin="11" end="0" resetval="0x0" description="Divider value corresponding MCAN selected clock.To set the divider value of [n+1] configure the register to value of '0xnnn'.Data should be loaded as multibit.  For example:  if divider value of '0x9' is required then '0x888' should be configured to the register." range="11:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MSS_MCAN2_CLK_DIV_VAL" acronym="MSS_RCM_MSS_MCAN2_CLK_DIV_VAL" offset="520" width="32" description="This Register is used to select the Divider value for respective clk.">
		<bitfield id="MSS_MCAN2_CLK_DIV_VAL_CLKDIVR" width="12" begin="11" end="0" resetval="0x0" description="Divider value corresponding MCAN selected clock.To set the divider value of [n+1] configure the register to value of '0xnnn'.Data should be loaded as multibit.  For example:  if divider value of '0x9' is required then '0x888' should be configured to the register." range="11:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MSS_MCAN3_CLK_DIV_VAL" acronym="MSS_RCM_MSS_MCAN3_CLK_DIV_VAL" offset="524" width="32" description="This Register is used to select the Divider value for respective clk.">
		<bitfield id="MSS_MCAN3_CLK_DIV_VAL_CLKDIVR" width="12" begin="11" end="0" resetval="0x0" description="Divider value corresponding MCAN selected clock.To set the divider value of [n+1] configure the register to value of '0xnnn'.Data should be loaded as multibit.  For example:  if divider value of '0x9' is required then '0x888' should be configured to the register." range="11:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MSS_QSPI_CLK_DIV_VAL" acronym="MSS_RCM_MSS_QSPI_CLK_DIV_VAL" offset="528" width="32" description="This Register is used to select the Divider value for respective clk.">
		<bitfield id="MSS_QSPI_CLK_DIV_VAL_CLKDIVR" width="12" begin="11" end="0" resetval="0x0" description="Divider value corresponding QSPI selected clock.To set the divider value of [n+1] configure the register to value of '0xnnn'.Data should be loaded as multibit.  For example:  if divider value of '0x9' is required then '0x888' should be configured to the register." range="11:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MSS_RTI0_CLK_DIV_VAL" acronym="MSS_RCM_MSS_RTI0_CLK_DIV_VAL" offset="532" width="32" description="This Register is used to select the Divider value for respective clk.">
		<bitfield id="MSS_RTI0_CLK_DIV_VAL_CLKDIVR" width="12" begin="11" end="0" resetval="0x0" description="Divider value Corresponding RTI selected clock.To set the divider value of [n+1] configure the register to value of '0xnnn'.Data should be loaded as multibit.  For example:  if divider value of '0x9' is required then '0x888' should be configured to the register." range="11:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MSS_RTI1_CLK_DIV_VAL" acronym="MSS_RCM_MSS_RTI1_CLK_DIV_VAL" offset="536" width="32" description="This Register is used to select the Divider value for respective clk.">
		<bitfield id="MSS_RTI1_CLK_DIV_VAL_CLKDIVR" width="12" begin="11" end="0" resetval="0x0" description="Divider value Corresponding RTI selected clock.To set the divider value of [n+1] configure the register to value of '0xnnn'.Data should be loaded as multibit.  For example:  if divider value of '0x9' is required then '0x888' should be configured to the register." range="11:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MSS_RTI2_CLK_DIV_VAL" acronym="MSS_RCM_MSS_RTI2_CLK_DIV_VAL" offset="540" width="32" description="This Register is used to select the Divider value for respective clk.">
		<bitfield id="MSS_RTI2_CLK_DIV_VAL_CLKDIVR" width="12" begin="11" end="0" resetval="0x0" description="Divider value Corresponding RTI selected clock.To set the divider value of [n+1] configure the register to value of '0xnnn'.Data should be loaded as multibit.  For example:  if divider value of '0x9' is required then '0x888' should be configured to the register." range="11:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MSS_RTI3_CLK_DIV_VAL" acronym="MSS_RCM_MSS_RTI3_CLK_DIV_VAL" offset="544" width="32" description="This Register is used to select the Divider value for respective clk.">
		<bitfield id="MSS_RTI3_CLK_DIV_VAL_CLKDIVR" width="12" begin="11" end="0" resetval="0x0" description="Divider value Corresponding RTI selected clock.To set the divider value of [n+1] configure the register to value of '0xnnn'.Data should be loaded as multibit.  For example:  if divider value of '0x9' is required then '0x888' should be configured to the register." range="11:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MSS_WDT0_CLK_DIV_VAL" acronym="MSS_RCM_MSS_WDT0_CLK_DIV_VAL" offset="552" width="32" description="This Register is used to select the Divider value for respective clk.">
		<bitfield id="MSS_WDT0_CLK_DIV_VAL_CLKDIVR" width="12" begin="11" end="0" resetval="0x0" description="Divider value WDT selected clock.To set the divider value of [n+1] configure the register to value of '0xnnn'.Data should be loaded as multibit.  For example:  if divider value of '0x9' is required then '0x888' should be configured to the register." range="11:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MSS_WDT1_CLK_DIV_VAL" acronym="MSS_RCM_MSS_WDT1_CLK_DIV_VAL" offset="556" width="32" description="This Register is used to select the Divider value for respective clk.">
		<bitfield id="MSS_WDT1_CLK_DIV_VAL_CLKDIVR" width="12" begin="11" end="0" resetval="0x0" description="Divider value WDT selected clock.To set the divider value of [n+1] configure the register to value of '0xnnn'.Data should be loaded as multibit.  For example:  if divider value of '0x9' is required then '0x888' should be configured to the register." range="11:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MSS_WDT2_CLK_DIV_VAL" acronym="MSS_RCM_MSS_WDT2_CLK_DIV_VAL" offset="560" width="32" description="This Register is used to select the Divider value for respective clk.">
		<bitfield id="MSS_WDT2_CLK_DIV_VAL_CLKDIVR" width="12" begin="11" end="0" resetval="0x0" description="Divider value WDT selected clock.To set the divider value of [n+1] configure the register to value of '0xnnn'.Data should be loaded as multibit.  For example:  if divider value of '0x9' is required then '0x888' should be configured to the register." range="11:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MSS_WDT3_CLK_DIV_VAL" acronym="MSS_RCM_MSS_WDT3_CLK_DIV_VAL" offset="564" width="32" description="This Register is used to select the Divider value for respective clk.">
		<bitfield id="MSS_WDT3_CLK_DIV_VAL_CLKDIVR" width="12" begin="11" end="0" resetval="0x0" description="Divider value WDT selected clock.To set the divider value of [n+1] configure the register to value of '0xnnn'.Data should be loaded as multibit.  For example:  if divider value of '0x9' is required then '0x888' should be configured to the register." range="11:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MSS_SPI0_CLK_DIV_VAL" acronym="MSS_RCM_MSS_SPI0_CLK_DIV_VAL" offset="572" width="32" description="This Register is used to select the Divider value for respective clk.">
		<bitfield id="MSS_SPI0_CLK_DIV_VAL_CLKDIVR" width="12" begin="11" end="0" resetval="0x0" description="Divider value Corresponding SPI selected clock.To set the divider value of [n+1] configure the register to value of '0xnnn'.Data should be loaded as multibit.  For example:  if divider value of '0x9' is required then '0x888' should be configured to the register." range="11:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MSS_SPI1_CLK_DIV_VAL" acronym="MSS_RCM_MSS_SPI1_CLK_DIV_VAL" offset="576" width="32" description="This Register is used to select the Divider value for respective clk.">
		<bitfield id="MSS_SPI1_CLK_DIV_VAL_CLKDIVR" width="12" begin="11" end="0" resetval="0x0" description="Divider value Corresponding SPI selected clock.To set the divider value of [n+1] configure the register to value of '0xnnn'.Data should be loaded as multibit.  For example:  if divider value of '0x9' is required then '0x888' should be configured to the register." range="11:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MSS_SPI2_CLK_DIV_VAL" acronym="MSS_RCM_MSS_SPI2_CLK_DIV_VAL" offset="580" width="32" description="This Register is used to select the Divider value for respective clk.">
		<bitfield id="MSS_SPI2_CLK_DIV_VAL_CLKDIVR" width="12" begin="11" end="0" resetval="0x0" description="Divider value Corresponding SPI selected clock.To set the divider value of [n+1] configure the register to value of '0xnnn'.Data should be loaded as multibit.  For example:  if divider value of '0x9' is required then '0x888' should be configured to the register." range="11:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MSS_SPI3_CLK_DIV_VAL" acronym="MSS_RCM_MSS_SPI3_CLK_DIV_VAL" offset="584" width="32" description="This Register is used to select the Divider value for respective clk.">
		<bitfield id="MSS_SPI3_CLK_DIV_VAL_CLKDIVR" width="12" begin="11" end="0" resetval="0x0" description="Divider value Corresponding SPI selected clock.To set the divider value of [n+1] configure the register to value of '0xnnn'.Data should be loaded as multibit.  For example:  if divider value of '0x9' is required then '0x888' should be configured to the register." range="11:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MSS_SPI4_CLK_DIV_VAL" acronym="MSS_RCM_MSS_SPI4_CLK_DIV_VAL" offset="588" width="32" description="This Register is used to select the Divider value for respective clk.">
		<bitfield id="MSS_SPI4_CLK_DIV_VAL_CLKDIVR" width="12" begin="11" end="0" resetval="0x0" description="Divider value Corresponding SPI selected clock.To set the divider value of [n+1] configure the register to value of '0xnnn'.Data should be loaded as multibit.  For example:  if divider value of '0x9' is required then '0x888' should be configured to the register." range="11:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MSS_MMCSD_CLK_DIV_VAL" acronym="MSS_RCM_MSS_MMCSD_CLK_DIV_VAL" offset="592" width="32" description="This Register is used to select the Divider value for respective clk.">
		<bitfield id="MSS_MMCSD_CLK_DIV_VAL_CLKDIVR" width="12" begin="11" end="0" resetval="0x0" description="Divider value MMCSD selected clock.To set the divider value of [n+1] configure the register to value of '0xnnn'.Data should be loaded as multibit.  For example:  if divider value of '0x9' is required then '0x888' should be configured to the register." range="11:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_PRU_ICSS_UCLK_CLK_DIV_VAL" acronym="MSS_RCM_PRU_ICSS_UCLK_CLK_DIV_VAL" offset="596" width="32" description="This Register is used to select the Divider value for respective clk.">
		<bitfield id="PRU_ICSS_UCLK_CLK_DIV_VAL_CLKDIVR" width="12" begin="11" end="0" resetval="0x0" description="Divider value ICSSM_UCLK selected clock.To set the divider value of [n+1] configure the register to value of '0xnnn'.Data should be loaded as multibit.  For example:  if divider value of '0x9' is required then '0x888' should be configured to the register." range="11:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MSS_CPTS_CLK_DIV_VAL" acronym="MSS_RCM_MSS_CPTS_CLK_DIV_VAL" offset="600" width="32" description="This Register is used to select the Divider value for respective clk.">
		<bitfield id="MSS_CPTS_CLK_DIV_VAL_CLKDIVR" width="12" begin="11" end="0" resetval="0x0" description="Divider value CPTS selected clock.To set the divider value of [n+1] configure the register to value of '0xnnn'.Data should be loaded as multibit.  For example:  if divider value of '0x9' is required then '0x888' should be configured to the register." range="11:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_GPMC_CLK_DIV_VAL" acronym="MSS_RCM_GPMC_CLK_DIV_VAL" offset="604" width="32" description="This Register is used to select the Divider value for respective clk.">
		<bitfield id="GPMC_CLK_DIV_VAL_CLKDIVR" width="12" begin="11" end="0" resetval="0x0" description="Divider value GPMC selected clock.To set the divider value of [n+1] configure the register to value of '0xnnn'.Data should be loaded as multibit.  For example:  if divider value of '0x9' is required then '0x888' should be configured to the register." range="11:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_CONTROLSS_PLL_CLK_DIV_VAL" acronym="MSS_RCM_CONTROLSS_PLL_CLK_DIV_VAL" offset="608" width="32" description="CONTROLSS_PLL_CLK Divider Value for Control subsystem.">
		<bitfield id="CONTROLSS_PLL_CLK_DIV_VAL_CLKDIVR" width="12" begin="11" end="0" resetval="0x0" description="Divider value CONTROLSS_PLL selected clock.To set the divider value of [n+1] configure the register to value of '0xnnn'.Data should be loaded as multibit.  For example:  if divider value of '0x9' is required then '0x888' should be configured to the register." range="11:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MSS_I2C_CLK_DIV_VAL" acronym="MSS_RCM_MSS_I2C_CLK_DIV_VAL" offset="612" width="32" description="This Register is used to select the Divider value for respective clk.">
		<bitfield id="MSS_I2C_CLK_DIV_VAL_CLKDIVR" width="12" begin="11" end="0" resetval="0x0" description="Divider value I2C selected clock.To set the divider value of [n+1] configure the register to value of '0xnnn'.Data should be loaded as multibit.  For example:  if divider value of '0x9' is required then '0x888' should be configured to the register." range="11:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MSS_LIN0_UART0_CLK_DIV_VAL" acronym="MSS_RCM_MSS_LIN0_UART0_CLK_DIV_VAL" offset="628" width="32" description="This Register is used to select the Divider value for respective clk.">
