ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/AM263X/MSS_RCM_MSS_RCM_53208000h.xml
		<bitfield id="MSS_LIN0_UART0_CLK_DIV_VAL_CLKDIVR" width="12" begin="11" end="0" resetval="0x0" description="Divider value for corresponding UART and LIN selected clock.To set the divider value of [n+1] configure the register to value of '0xnnn'.Data should be loaded as multibit.  For example:  if divider value of '0x9' is required then '0x888' should be configured to the register." range="11:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MSS_LIN1_UART1_CLK_DIV_VAL" acronym="MSS_RCM_MSS_LIN1_UART1_CLK_DIV_VAL" offset="632" width="32" description="This Register is used to select the Divider value for respective clk.">
		<bitfield id="MSS_LIN1_UART1_CLK_DIV_VAL_CLKDIVR" width="12" begin="11" end="0" resetval="0x0" description="Divider value for corresponding UART and LIN selected clock.To set the divider value of [n+1] configure the register to value of '0xnnn'.Data should be loaded as multibit.  For example:  if divider value of '0x9' is required then '0x888' should be configured to the register." range="11:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MSS_LIN2_UART2_CLK_DIV_VAL" acronym="MSS_RCM_MSS_LIN2_UART2_CLK_DIV_VAL" offset="636" width="32" description="This Register is used to select the Divider value for respective clk.">
		<bitfield id="MSS_LIN2_UART2_CLK_DIV_VAL_CLKDIVR" width="12" begin="11" end="0" resetval="0x0" description="Divider value for corresponding UART and LIN selected clock.To set the divider value of [n+1] configure the register to value of '0xnnn'.Data should be loaded as multibit.  For example:  if divider value of '0x9' is required then '0x888' should be configured to the register." range="11:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MSS_LIN3_UART3_CLK_DIV_VAL" acronym="MSS_RCM_MSS_LIN3_UART3_CLK_DIV_VAL" offset="640" width="32" description="This Register is used to select the Divider value for respective clk.">
		<bitfield id="MSS_LIN3_UART3_CLK_DIV_VAL_CLKDIVR" width="12" begin="11" end="0" resetval="0x0" description="Divider value for corresponding UART and LIN selected clock.To set the divider value of [n+1] configure the register to value of '0xnnn'.Data should be loaded as multibit.  For example:  if divider value of '0x9' is required then '0x888' should be configured to the register." range="11:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MSS_LIN4_UART4_CLK_DIV_VAL" acronym="MSS_RCM_MSS_LIN4_UART4_CLK_DIV_VAL" offset="644" width="32" description="This Register is used to select the Divider value for respective clk.">
		<bitfield id="MSS_LIN4_UART4_CLK_DIV_VAL_CLKDIVR" width="12" begin="11" end="0" resetval="0x0" description="Divider value for corresponding UART and LIN selected clock.To set the divider value of [n+1] configure the register to value of '0xnnn'.Data should be loaded as multibit.  For example:  if divider value of '0x9' is required then '0x888' should be configured to the register." range="11:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MSS_LIN5_UART5_CLK_DIV_VAL" acronym="MSS_RCM_MSS_LIN5_UART5_CLK_DIV_VAL" offset="648" width="32" description="This Register is used to select the Divider value for respective clk.">
		<bitfield id="MSS_LIN5_UART5_CLK_DIV_VAL_CLKDIVR" width="12" begin="11" end="0" resetval="0x0" description="Divider value for corresponding UART and LIN selected clock.To set the divider value of [n+1] configure the register to value of '0xnnn'.Data should be loaded as multibit.  For example:  if divider value of '0x9' is required then '0x888' should be configured to the register." range="11:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MSS_RGMII_CLK_DIV_VAL" acronym="MSS_RCM_MSS_RGMII_CLK_DIV_VAL" offset="652" width="32" description="RGMII 250 CLK Divider Value.">
		<bitfield id="MSS_RGMII_CLK_DIV_VAL_CLKDIVR" width="12" begin="11" end="0" resetval="0x273" description="Divider value RGMII selected clock.To set the divider value of [n+1] configure the register to value of '0xnnn'.Data should be loaded as multibit.  For example:  if divider value of '0x9' is required then '0x888' should be configured to the register." range="11:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MSS_MII100_CLK_DIV_VAL" acronym="MSS_RCM_MSS_MII100_CLK_DIV_VAL" offset="656" width="32" description="This Register is used to enable clk gating for the respective clk.">
		<bitfield id="MSS_MII100_CLK_DIV_VAL_CLKDIVR" width="12" begin="11" end="0" resetval="0x2457" description="Divider value MII100 selected clock.To set the divider value of [n+1] configure the register to value of '0xnnn'.Data should be loaded as multibit.  For example:  if divider value of '0x9' is required then '0x888' should be configured to the register." range="11:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MSS_MII10_CLK_DIV_VAL" acronym="MSS_RCM_MSS_MII10_CLK_DIV_VAL" offset="660" width="32" description="RGMII 50 CLK Divider Value.">
		<bitfield id="MSS_MII10_CLK_DIV_VAL_CLKDIVR" width="24" begin="23" end="0" resetval="0x6513507" description="Divider value MII10 selected clock.To set the divider value of [n+1] configure the register to value of '0xnnn'.Data should be loaded as multibit.  For example:  if divider value of '0x15' is required then '0x151515' should be configured to the register." range="23:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MSS_XTAL_32K_CLK_DIV_VAL" acronym="MSS_RCM_MSS_XTAL_32K_CLK_DIV_VAL" offset="664" width="32" description="RGMII 5 CLK Divider Value.">
		<bitfield id="MSS_XTAL_32K_CLK_DIV_VAL_CLKDIVR" width="30" begin="29" end="0" resetval="0x818688780" description="Divider value for XTAL_32K clock. To set the divider value of [n+1] configure the register to value of '0xnnn'.Data should be loaded as multibit. For example: if divider value of '0x30C' is required then register should be configured as follows -bits[9:0] = 0x30Cbits[19:10] = 0x30Cbits[29:20] = 0x30CThis configures the register to 0x30CC330C" range="29:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_XTAL_TEMPSENSE_32K_CLK_DIV_VAL" acronym="MSS_RCM_XTAL_TEMPSENSE_32K_CLK_DIV_VAL" offset="668" width="32" description="XTAL 32K CLK Divider Value for MMC.">
		<bitfield id="XTAL_TEMPSENSE_32K_CLK_DIV_VAL_CLKDIVR" width="30" begin="29" end="0" resetval="0x818688780" description="Divider value for XTAL_32K clock. To set the divider value of [n+1] configure the register to value of '0xnnn'.Data should be loaded as multibit. For example: if divider value of '0x30C' is required then register should be configured as follows -bits[9:0] = 0x30Cbits[19:10] = 0x30Cbits[29:20] = 0x30CThis configures the register to 0x30CC330C" range="29:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MSS_ELM_CLK_DIV_VAL" acronym="MSS_RCM_MSS_ELM_CLK_DIV_VAL" offset="672" width="32" description="XTAL 32K CLK Divider Value for Temp Sensor.">
		<bitfield id="MSS_ELM_CLK_DIV_VAL_CLKDIVR" width="12" begin="11" end="0" resetval="0x819" description="Divider value ELM clock.To set the divider value of [n+1] configure the register to value of '0xnnn'.Data should be loaded as multibit.  For example:  if divider value of '0x9' is required then '0x888' should be configured to the register." range="11:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MSS_MCAN0_CLK_GATE" acronym="MSS_RCM_MSS_MCAN0_CLK_GATE" offset="768" width="32" description="ELM CLK Divider Value.">
		<bitfield id="MSS_MCAN0_CLK_GATE_GATED" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111  will gate clock for corresponding MCAN" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MSS_MCAN1_CLK_GATE" acronym="MSS_RCM_MSS_MCAN1_CLK_GATE" offset="772" width="32" description="This Register is used to enable clk gating for the respective clk.">
		<bitfield id="MSS_MCAN1_CLK_GATE_GATED" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111  will gate clock for corresponding MCAN" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MSS_MCAN2_CLK_GATE" acronym="MSS_RCM_MSS_MCAN2_CLK_GATE" offset="776" width="32" description="This Register is used to enable clk gating for the respective clk.">
		<bitfield id="MSS_MCAN2_CLK_GATE_GATED" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111  will gate clock for corresponding MCAN" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MSS_MCAN3_CLK_GATE" acronym="MSS_RCM_MSS_MCAN3_CLK_GATE" offset="780" width="32" description="This Register is used to enable clk gating for the respective clk.">
		<bitfield id="MSS_MCAN3_CLK_GATE_GATED" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111  will gate clock for corresponding MCAN" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MSS_QSPI_CLK_GATE" acronym="MSS_RCM_MSS_QSPI_CLK_GATE" offset="784" width="32" description="This Register is used to enable clk gating for the respective clk.">
		<bitfield id="MSS_QSPI_CLK_GATE_GATED" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111  will gate clock for QSPI" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MSS_RTI0_CLK_GATE" acronym="MSS_RCM_MSS_RTI0_CLK_GATE" offset="788" width="32" description="This Register is used to enable clk gating for the respective clk.">
		<bitfield id="MSS_RTI0_CLK_GATE_GATED" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111  will gate clock for Corresponding RTI" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MSS_RTI1_CLK_GATE" acronym="MSS_RCM_MSS_RTI1_CLK_GATE" offset="792" width="32" description="This Register is used to enable clk gating for the respective clk.">
		<bitfield id="MSS_RTI1_CLK_GATE_GATED" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111  will gate clock for Corresponding RTI" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MSS_RTI2_CLK_GATE" acronym="MSS_RCM_MSS_RTI2_CLK_GATE" offset="796" width="32" description="This Register is used to enable clk gating for the respective clk.">
		<bitfield id="MSS_RTI2_CLK_GATE_GATED" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111  will gate clock for Corresponding RTI" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MSS_RTI3_CLK_GATE" acronym="MSS_RCM_MSS_RTI3_CLK_GATE" offset="800" width="32" description="This Register is used to enable clk gating for the respective clk.">
		<bitfield id="MSS_RTI3_CLK_GATE_GATED" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111  will gate clock for Corresponding RTI" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MSS_WDT0_CLK_GATE" acronym="MSS_RCM_MSS_WDT0_CLK_GATE" offset="808" width="32" description="This Register is used to enable clk gating for the respective clk.">
		<bitfield id="MSS_WDT0_CLK_GATE_GATED" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111  will gate clock for corresponding WDT" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MSS_WDT1_CLK_GATE" acronym="MSS_RCM_MSS_WDT1_CLK_GATE" offset="812" width="32" description="This Register is used to enable clk gating for the respective clk.">
		<bitfield id="MSS_WDT1_CLK_GATE_GATED" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111  will gate clock for corresponding WDT" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MSS_WDT2_CLK_GATE" acronym="MSS_RCM_MSS_WDT2_CLK_GATE" offset="816" width="32" description="This Register is used to enable clk gating for the respective clk.">
		<bitfield id="MSS_WDT2_CLK_GATE_GATED" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111  will gate clock for corresponding WDT" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MSS_WDT3_CLK_GATE" acronym="MSS_RCM_MSS_WDT3_CLK_GATE" offset="820" width="32" description="This Register is used to enable clk gating for the respective clk.">
		<bitfield id="MSS_WDT3_CLK_GATE_GATED" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111  will gate clock for corresponding WDT" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MSS_SPI0_CLK_GATE" acronym="MSS_RCM_MSS_SPI0_CLK_GATE" offset="828" width="32" description="This Register is used to enable clk gating for the respective clk.">
		<bitfield id="MSS_SPI0_CLK_GATE_GATED" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111  will gate clock for Corresponding SPI" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MSS_SPI1_CLK_GATE" acronym="MSS_RCM_MSS_SPI1_CLK_GATE" offset="832" width="32" description="This Register is used to enable clk gating for the respective clk.">
		<bitfield id="MSS_SPI1_CLK_GATE_GATED" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111  will gate clock for Corresponding SPI" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MSS_SPI2_CLK_GATE" acronym="MSS_RCM_MSS_SPI2_CLK_GATE" offset="836" width="32" description="This Register is used to enable clk gating for the respective clk.">
		<bitfield id="MSS_SPI2_CLK_GATE_GATED" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111  will gate clock for Corresponding SPI" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MSS_SPI3_CLK_GATE" acronym="MSS_RCM_MSS_SPI3_CLK_GATE" offset="840" width="32" description="This Register is used to enable clk gating for the respective clk.">
		<bitfield id="MSS_SPI3_CLK_GATE_GATED" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111  will gate clock for Corresponding SPI" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MSS_SPI4_CLK_GATE" acronym="MSS_RCM_MSS_SPI4_CLK_GATE" offset="844" width="32" description="This Register is used to enable clk gating for the respective clk.">
		<bitfield id="MSS_SPI4_CLK_GATE_GATED" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111  will gate clock for Corresponding SPI" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MSS_MMCSD_CLK_GATE" acronym="MSS_RCM_MSS_MMCSD_CLK_GATE" offset="848" width="32" description="This Register is used to enable clk gating for the respective clk.">
		<bitfield id="MSS_MMCSD_CLK_GATE_GATED" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111  will gate clock for MMCSD" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_PRU_ICSS_UCLK_CLK_GATE" acronym="MSS_RCM_PRU_ICSS_UCLK_CLK_GATE" offset="852" width="32" description="This Register is used to enable clk gating for the respective clk.">
		<bitfield id="PRU_ICSS_UCLK_CLK_GATE_GATED" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111  will gate clock for ICSSM_UCLK" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MSS_CPTS_CLK_GATE" acronym="MSS_RCM_MSS_CPTS_CLK_GATE" offset="856" width="32" description="This Register is used to enable clk gating for the respective clk.">
		<bitfield id="MSS_CPTS_CLK_GATE_GATED" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111  will gate clock for CPTS" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_GPMC_CLK_GATE" acronym="MSS_RCM_GPMC_CLK_GATE" offset="860" width="32" description="This Register is used to enable clk gating for the respective clk.">
		<bitfield id="GPMC_CLK_GATE_GATED" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111  will gate clock for GPMC" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_CONTROLSS_PLL_CLK_GATE" acronym="MSS_RCM_CONTROLSS_PLL_CLK_GATE" offset="864" width="32" description="This Register is used to enable clk gating for the respective clk.">
		<bitfield id="CONTROLSS_PLL_CLK_GATE_GATED" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111  will gate clock for CONTROLSS_PLL" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MSS_I2C0_CLK_GATE" acronym="MSS_RCM_MSS_I2C0_CLK_GATE" offset="868" width="32" description="This Register is used to enable clk gating for the respective clk.">
		<bitfield id="MSS_I2C0_CLK_GATE_GATED" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111  will gate clock for corresponding I2C" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MSS_I2C1_CLK_GATE" acronym="MSS_RCM_MSS_I2C1_CLK_GATE" offset="872" width="32" description="This Register is used to enable clk gating for the respective clk.">
		<bitfield id="MSS_I2C1_CLK_GATE_GATED" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111  will gate clock for corresponding I2C" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MSS_I2C2_CLK_GATE" acronym="MSS_RCM_MSS_I2C2_CLK_GATE" offset="876" width="32" description="This Register is used to enable clk gating for the respective clk.">
		<bitfield id="MSS_I2C2_CLK_GATE_GATED" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111  will gate clock for corresponding I2C" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MSS_I2C3_CLK_GATE" acronym="MSS_RCM_MSS_I2C3_CLK_GATE" offset="880" width="32" description="This Register is used to enable clk gating for the respective clk.">
		<bitfield id="MSS_I2C3_CLK_GATE_GATED" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111  will gate clock for corresponding I2C" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MSS_LIN0_CLK_GATE" acronym="MSS_RCM_MSS_LIN0_CLK_GATE" offset="884" width="32" description="This Register is used to enable clk gating for the respective clk.">
		<bitfield id="MSS_LIN0_CLK_GATE_GATED" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111  will gate clock for corresponding LIN" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MSS_LIN1_CLK_GATE" acronym="MSS_RCM_MSS_LIN1_CLK_GATE" offset="888" width="32" description="This Register is used to enable clk gating for the respective clk.">
		<bitfield id="MSS_LIN1_CLK_GATE_GATED" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111  will gate clock for corresponding LIN" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MSS_LIN2_CLK_GATE" acronym="MSS_RCM_MSS_LIN2_CLK_GATE" offset="892" width="32" description="This Register is used to enable clk gating for the respective clk.">
		<bitfield id="MSS_LIN2_CLK_GATE_GATED" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111  will gate clock for corresponding LIN" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MSS_LIN3_CLK_GATE" acronym="MSS_RCM_MSS_LIN3_CLK_GATE" offset="896" width="32" description="This Register is used to enable clk gating for the respective clk.">
		<bitfield id="MSS_LIN3_CLK_GATE_GATED" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111  will gate clock for corresponding LIN" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MSS_LIN4_CLK_GATE" acronym="MSS_RCM_MSS_LIN4_CLK_GATE" offset="900" width="32" description="This Register is used to enable clk gating for the respective clk.">
		<bitfield id="MSS_LIN4_CLK_GATE_GATED" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111  will gate clock for corresponding LIN" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MSS_UART0_CLK_GATE" acronym="MSS_RCM_MSS_UART0_CLK_GATE" offset="908" width="32" description="This Register is used to enable clk gating for the respective clk.">
		<bitfield id="MSS_UART0_CLK_GATE_GATED" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111  will gate clock for corresponding UART" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MSS_UART1_CLK_GATE" acronym="MSS_RCM_MSS_UART1_CLK_GATE" offset="912" width="32" description="This Register is used to enable clk gating for the respective clk.">
		<bitfield id="MSS_UART1_CLK_GATE_GATED" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111  will gate clock for corresponding UART" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MSS_UART2_CLK_GATE" acronym="MSS_RCM_MSS_UART2_CLK_GATE" offset="916" width="32" description="This Register is used to enable clk gating for the respective clk.">
		<bitfield id="MSS_UART2_CLK_GATE_GATED" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111  will gate clock for corresponding UART" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MSS_UART3_CLK_GATE" acronym="MSS_RCM_MSS_UART3_CLK_GATE" offset="920" width="32" description="This Register is used to enable clk gating for the respective clk.">
		<bitfield id="MSS_UART3_CLK_GATE_GATED" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111  will gate clock for corresponding UART" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MSS_UART4_CLK_GATE" acronym="MSS_RCM_MSS_UART4_CLK_GATE" offset="924" width="32" description="This Register is used to enable clk gating for the respective clk.">
		<bitfield id="MSS_UART4_CLK_GATE_GATED" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111  will gate clock for corresponding UART" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MSS_UART5_CLK_GATE" acronym="MSS_RCM_MSS_UART5_CLK_GATE" offset="928" width="32" description="This Register is used to enable clk gating for the respective clk.">
		<bitfield id="MSS_UART5_CLK_GATE_GATED" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111  will gate clock for corresponding UART" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MSS_RGMII_CLK_GATE" acronym="MSS_RCM_MSS_RGMII_CLK_GATE" offset="932" width="32" description="This Register is used to enable clk gating for the respective clk.">
		<bitfield id="MSS_RGMII_CLK_GATE_GATED" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111  will gate clock for RGMII" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MSS_MII100_CLK_GATE" acronym="MSS_RCM_MSS_MII100_CLK_GATE" offset="936" width="32" description="This Register is used to enable clk gating for the respective clk.">
		<bitfield id="MSS_MII100_CLK_GATE_GATED" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111  will gate clock for MII100" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MSS_MII10_CLK_GATE" acronym="MSS_RCM_MSS_MII10_CLK_GATE" offset="940" width="32" description="This Register is used to enable clk gating for the respective clk.">
		<bitfield id="MSS_MII10_CLK_GATE_GATED" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111  will gate clock for MII10" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MSS_MMCSD_32K_CLK_GATE" acronym="MSS_RCM_MSS_MMCSD_32K_CLK_GATE" offset="944" width="32" description="Clock source selection and Divider Value  of respective clock.">
		<bitfield id="MSS_MMCSD_32K_CLK_GATE_GATED" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111  will gate clock for MMCSD_32K" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MSS_TEMPSENSE_32K_CLK_GATE" acronym="MSS_RCM_MSS_TEMPSENSE_32K_CLK_GATE" offset="948" width="32" description="This Register is used to enable clk gating for the respective clk.">
		<bitfield id="MSS_TEMPSENSE_32K_CLK_GATE_GATED" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111  will gate clock for TEMPSENSE_32K" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MSS_CPSW_CLK_GATE" acronym="MSS_RCM_MSS_CPSW_CLK_GATE" offset="952" width="32" description="This Register is used to enable clk gating for the respective clk.">
		<bitfield id="MSS_CPSW_CLK_GATE_GATED" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111  will gate clock for CPSW CPPI" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MSS_PRU_ICSS_IEP_CLK_GATE" acronym="MSS_RCM_MSS_PRU_ICSS_IEP_CLK_GATE" offset="956" width="32" description="This Register is used to enable clk gating for the respective clk.">
