ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/AM263X/MSS_RCM_MSS_RCM_53208000h.xml
		<bitfield id="MSS_PRU_ICSS_IEP_CLK_GATE_GATED" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111  will gate clock for ICSSM_IEP" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MSS_PRU_ICSS_CORE_CLK_GATE" acronym="MSS_RCM_MSS_PRU_ICSS_CORE_CLK_GATE" offset="960" width="32" description="This Register is used to enable clk gating for the respective clk.">
		<bitfield id="MSS_PRU_ICSS_CORE_CLK_GATE_GATED" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111  will gate clock for ICSSM_CORE" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MSS_PRU_ICSS_SYS_CLK_GATE" acronym="MSS_RCM_MSS_PRU_ICSS_SYS_CLK_GATE" offset="964" width="32" description="This Register is used to enable clk gating for the respective clk.">
		<bitfield id="MSS_PRU_ICSS_SYS_CLK_GATE_GATED" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111  will gate clock for ICSSM_SYS" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MSS_ELM_CLK_GATE" acronym="MSS_RCM_MSS_ELM_CLK_GATE" offset="968" width="32" description="This Register is used to enable clk gating for the respective clk.">
		<bitfield id="MSS_ELM_CLK_GATE_GATED" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111  will gate clock for ELM" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_R5_CORE0_GATE0" acronym="MSS_RCM_R5_CORE0_GATE0" offset="972" width="32" description="This Register is used to enable clk gating for the respective clk.">
		<bitfield id="R5_COREA_GATE0_CLKGATE" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111  will gate clock to CORE0 related peripherals inside corresponding Cortexr5ss" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_R5_CORE0_GATE1" acronym="MSS_RCM_R5_CORE0_GATE1" offset="976" width="32" description="Clock gating for individual CPU core. ">
		<bitfield id="R5_COREA_GATE1_CLKGATE" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111  will gate clock to CORE0 related peripherals inside corresponding Cortexr5ss" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_R5_CORE1_GATE0" acronym="MSS_RCM_R5_CORE1_GATE0" offset="980" width="32" description="Clock gating for individual CPU core. ">
		<bitfield id="R5_COREB_GATE0_CLKGATE" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111  will gate clock to CORE1 related peripherals inside corresponding Cortexr5ss" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_R5_CORE1_GATE1" acronym="MSS_RCM_R5_CORE1_GATE1" offset="984" width="32" description="Clock gating for individual CPU core. ">
		<bitfield id="R5_COREB_GATE1_CLKGATE" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111  will gate clock to CORE1 related peripherals inside corresponding Cortexr5ss" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MSS_MCAN0_CLK_STATUS" acronym="MSS_RCM_MSS_MCAN0_CLK_STATUS" offset="1024" width="32" description="Clock gating for individual CPU core. ">
		<bitfield id="MSS_MCAN0_CLK_STATUS_CURRDIVIDER" width="8" begin="15" end="8" resetval="0x0" description="Status shows the current divider value choosen for corresponding MCAN" range="15:8" rwaccess="R"/>
	<bitfield id="MSS_MCAN0_CLK_STATUS_CLKINUSE" width="8" begin="7" end="0" resetval="0x1" description="Status shows the source clock slected for corresponding MCAN based on one hot encoding technique." range="7:0" rwaccess="R"/>
	</register><register id="MSS_RCM_MSS_MCAN1_CLK_STATUS" acronym="MSS_RCM_MSS_MCAN1_CLK_STATUS" offset="1028" width="32" description="Clock source selection and Divider Value  of respective clock.">
		<bitfield id="MSS_MCAN1_CLK_STATUS_CURRDIVIDER" width="8" begin="15" end="8" resetval="0x0" description="Status shows the current divider value choosen for corresponding MCAN" range="15:8" rwaccess="R"/>
	<bitfield id="MSS_MCAN1_CLK_STATUS_CLKINUSE" width="8" begin="7" end="0" resetval="0x1" description="Status shows the source clock slected for corresponding MCAN based on one hot encoding technique." range="7:0" rwaccess="R"/>
	</register><register id="MSS_RCM_MSS_MCAN2_CLK_STATUS" acronym="MSS_RCM_MSS_MCAN2_CLK_STATUS" offset="1032" width="32" description="Clock source selection and Divider Value  of respective clock.">
		<bitfield id="MSS_MCAN2_CLK_STATUS_CURRDIVIDER" width="8" begin="15" end="8" resetval="0x0" description="Status shows the current divider value choosen for corresponding MCAN" range="15:8" rwaccess="R"/>
	<bitfield id="MSS_MCAN2_CLK_STATUS_CLKINUSE" width="8" begin="7" end="0" resetval="0x1" description="Status shows the source clock slected for corresponding MCAN based on one hot encoding technique." range="7:0" rwaccess="R"/>
	</register><register id="MSS_RCM_MSS_MCAN3_CLK_STATUS" acronym="MSS_RCM_MSS_MCAN3_CLK_STATUS" offset="1036" width="32" description="Clock source selection and Divider Value  of respective clock.">
		<bitfield id="MSS_MCAN3_CLK_STATUS_CURRDIVIDER" width="8" begin="15" end="8" resetval="0x0" description="Status shows the current divider value choosen for corresponding MCAN" range="15:8" rwaccess="R"/>
	<bitfield id="MSS_MCAN3_CLK_STATUS_CLKINUSE" width="8" begin="7" end="0" resetval="0x1" description="Status shows the source clock slected for corresponding MCAN based on one hot encoding technique." range="7:0" rwaccess="R"/>
	</register><register id="MSS_RCM_MSS_QSPI_CLK_STATUS" acronym="MSS_RCM_MSS_QSPI_CLK_STATUS" offset="1040" width="32" description="Clock source selection and Divider Value  of respective clock.">
		<bitfield id="MSS_QSPI_CLK_STATUS_CURRDIVIDER" width="8" begin="15" end="8" resetval="0x0" description="Status shows the current divider value choosen for QSPI" range="15:8" rwaccess="R"/>
	<bitfield id="MSS_QSPI_CLK_STATUS_CLKINUSE" width="8" begin="7" end="0" resetval="0x1" description="Status shows the source clock slected for QSPI based on one hot encoding technique." range="7:0" rwaccess="R"/>
	</register><register id="MSS_RCM_MSS_RTI0_CLK_STATUS" acronym="MSS_RCM_MSS_RTI0_CLK_STATUS" offset="1044" width="32" description="Clock source selection and Divider Value  of respective clock.">
		<bitfield id="MSS_RTI0_CLK_STATUS_CURRDIVIDER" width="8" begin="15" end="8" resetval="0x0" description="Status shows the current divider value choosen for Corresponding RTI" range="15:8" rwaccess="R"/>
	<bitfield id="MSS_RTI0_CLK_STATUS_CLKINUSE" width="8" begin="7" end="0" resetval="0x1" description="Status shows the source clock slected for Corresponding RTI based on one hot encoding technique." range="7:0" rwaccess="R"/>
	</register><register id="MSS_RCM_MSS_RTI1_CLK_STATUS" acronym="MSS_RCM_MSS_RTI1_CLK_STATUS" offset="1048" width="32" description="Clock source selection and Divider Value  of respective clock.">
		<bitfield id="MSS_RTI1_CLK_STATUS_CURRDIVIDER" width="8" begin="15" end="8" resetval="0x0" description="Status shows the current divider value choosen for Corresponding RTI" range="15:8" rwaccess="R"/>
	<bitfield id="MSS_RTI1_CLK_STATUS_CLKINUSE" width="8" begin="7" end="0" resetval="0x1" description="Status shows the source clock slected for Corresponding RTI based on one hot encoding technique." range="7:0" rwaccess="R"/>
	</register><register id="MSS_RCM_MSS_RTI2_CLK_STATUS" acronym="MSS_RCM_MSS_RTI2_CLK_STATUS" offset="1052" width="32" description="Clock source selection and Divider Value  of respective clock.">
		<bitfield id="MSS_RTI2_CLK_STATUS_CURRDIVIDER" width="8" begin="15" end="8" resetval="0x0" description="Status shows the current divider value choosen for Corresponding RTI" range="15:8" rwaccess="R"/>
	<bitfield id="MSS_RTI2_CLK_STATUS_CLKINUSE" width="8" begin="7" end="0" resetval="0x1" description="Status shows the source clock slected for Corresponding RTI based on one hot encoding technique." range="7:0" rwaccess="R"/>
	</register><register id="MSS_RCM_MSS_RTI3_CLK_STATUS" acronym="MSS_RCM_MSS_RTI3_CLK_STATUS" offset="1056" width="32" description="Clock source selection and Divider Value  of respective clock.">
		<bitfield id="MSS_RTI3_CLK_STATUS_CURRDIVIDER" width="8" begin="15" end="8" resetval="0x0" description="Status shows the current divider value choosen for Corresponding RTI" range="15:8" rwaccess="R"/>
	<bitfield id="MSS_RTI3_CLK_STATUS_CLKINUSE" width="8" begin="7" end="0" resetval="0x1" description="Status shows the source clock slected for Corresponding RTI based on one hot encoding technique." range="7:0" rwaccess="R"/>
	</register><register id="MSS_RCM_MSS_WDT0_CLK_STATUS" acronym="MSS_RCM_MSS_WDT0_CLK_STATUS" offset="1064" width="32" description="Clock source selection and Divider Value  of respective clock.">
		<bitfield id="MSS_WDT0_CLK_STATUS_CURRDIVIDER" width="8" begin="15" end="8" resetval="0x0" description="Status shows the current divider value choosen for corresponding WDT" range="15:8" rwaccess="R"/>
	<bitfield id="MSS_WDT0_CLK_STATUS_CLKINUSE" width="8" begin="7" end="0" resetval="0x1" description="Status shows the source clock slected for Corresponding WDT based on one hot encoding technique." range="7:0" rwaccess="R"/>
	</register><register id="MSS_RCM_MSS_WDT1_CLK_STATUS" acronym="MSS_RCM_MSS_WDT1_CLK_STATUS" offset="1068" width="32" description="Clock source selection and Divider Value  of respective clock.">
		<bitfield id="MSS_WDT1_CLK_STATUS_CURRDIVIDER" width="8" begin="15" end="8" resetval="0x0" description="Status shows the current divider value choosen for corresponding WDT" range="15:8" rwaccess="R"/>
	<bitfield id="MSS_WDT1_CLK_STATUS_CLKINUSE" width="8" begin="7" end="0" resetval="0x1" description="Status shows the source clock slected for Corresponding WDT based on one hot encoding technique." range="7:0" rwaccess="R"/>
	</register><register id="MSS_RCM_MSS_WDT2_CLK_STATUS" acronym="MSS_RCM_MSS_WDT2_CLK_STATUS" offset="1072" width="32" description="Clock source selection and Divider Value  of respective clock.">
		<bitfield id="MSS_WDT2_CLK_STATUS_CURRDIVIDER" width="8" begin="15" end="8" resetval="0x0" description="Status shows the current divider value choosen for corresponding WDT" range="15:8" rwaccess="R"/>
	<bitfield id="MSS_WDT2_CLK_STATUS_CLKINUSE" width="8" begin="7" end="0" resetval="0x1" description="Status shows the source clock slected for Corresponding WDT based on one hot encoding technique." range="7:0" rwaccess="R"/>
	</register><register id="MSS_RCM_MSS_WDT3_CLK_STATUS" acronym="MSS_RCM_MSS_WDT3_CLK_STATUS" offset="1076" width="32" description="Clock source selection and Divider Value  of respective clock.">
		<bitfield id="MSS_WDT3_CLK_STATUS_CURRDIVIDER" width="8" begin="15" end="8" resetval="0x0" description="Status shows the current divider value choosen for corresponding WDT" range="15:8" rwaccess="R"/>
	<bitfield id="MSS_WDT3_CLK_STATUS_CLKINUSE" width="8" begin="7" end="0" resetval="0x1" description="Status shows the source clock slected for Corresponding WDT based on one hot encoding technique." range="7:0" rwaccess="R"/>
	</register><register id="MSS_RCM_MSS_SPI0_CLK_STATUS" acronym="MSS_RCM_MSS_SPI0_CLK_STATUS" offset="1084" width="32" description="Clock source selection and Divider Value  of respective clock.">
		<bitfield id="MSS_SPI0_CLK_STATUS_CURRDIVIDER" width="8" begin="15" end="8" resetval="0x0" description="Status shows the current divider value choosen for Corresponding SPI" range="15:8" rwaccess="R"/>
	<bitfield id="MSS_SPI0_CLK_STATUS_CLKINUSE" width="8" begin="7" end="0" resetval="0x1" description="Status shows the source clock slected for Corresponding SPI based on one hot encoding technique." range="7:0" rwaccess="R"/>
	</register><register id="MSS_RCM_MSS_SPI1_CLK_STATUS" acronym="MSS_RCM_MSS_SPI1_CLK_STATUS" offset="1088" width="32" description="Clock source selection and Divider Value  of respective clock.">
		<bitfield id="MSS_SPI1_CLK_STATUS_CURRDIVIDER" width="8" begin="15" end="8" resetval="0x0" description="Status shows the current divider value choosen for Corresponding SPI" range="15:8" rwaccess="R"/>
	<bitfield id="MSS_SPI1_CLK_STATUS_CLKINUSE" width="8" begin="7" end="0" resetval="0x1" description="Status shows the source clock slected for Corresponding SPI based on one hot encoding technique." range="7:0" rwaccess="R"/>
	</register><register id="MSS_RCM_MSS_SPI2_CLK_STATUS" acronym="MSS_RCM_MSS_SPI2_CLK_STATUS" offset="1092" width="32" description="Clock source selection and Divider Value  of respective clock.">
		<bitfield id="MSS_SPI2_CLK_STATUS_CURRDIVIDER" width="8" begin="15" end="8" resetval="0x0" description="Status shows the current divider value choosen for Corresponding SPI" range="15:8" rwaccess="R"/>
	<bitfield id="MSS_SPI2_CLK_STATUS_CLKINUSE" width="8" begin="7" end="0" resetval="0x1" description="Status shows the source clock slected for Corresponding SPI based on one hot encoding technique." range="7:0" rwaccess="R"/>
	</register><register id="MSS_RCM_MSS_SPI3_CLK_STATUS" acronym="MSS_RCM_MSS_SPI3_CLK_STATUS" offset="1096" width="32" description="Clock source selection and Divider Value  of respective clock.">
		<bitfield id="MSS_SPI3_CLK_STATUS_CURRDIVIDER" width="8" begin="15" end="8" resetval="0x0" description="Status shows the current divider value choosen for Corresponding SPI" range="15:8" rwaccess="R"/>
	<bitfield id="MSS_SPI3_CLK_STATUS_CLKINUSE" width="8" begin="7" end="0" resetval="0x1" description="Status shows the source clock slected for Corresponding SPI based on one hot encoding technique." range="7:0" rwaccess="R"/>
	</register><register id="MSS_RCM_MSS_SPI4_CLK_STATUS" acronym="MSS_RCM_MSS_SPI4_CLK_STATUS" offset="1100" width="32" description="Clock source selection and Divider Value  of respective clock.">
		<bitfield id="MSS_SPI4_CLK_STATUS_CURRDIVIDER" width="8" begin="15" end="8" resetval="0x0" description="Status shows the current divider value choosen for Corresponding SPI" range="15:8" rwaccess="R"/>
	<bitfield id="MSS_SPI4_CLK_STATUS_CLKINUSE" width="8" begin="7" end="0" resetval="0x1" description="Status shows the source clock slected for Corresponding SPI based on one hot encoding technique." range="7:0" rwaccess="R"/>
	</register><register id="MSS_RCM_MSS_MMCSD_CLK_STATUS" acronym="MSS_RCM_MSS_MMCSD_CLK_STATUS" offset="1104" width="32" description="Clock source selection and Divider Value  of respective clock.">
		<bitfield id="MSS_MMCSD_CLK_STATUS_CURRDIVIDER" width="8" begin="15" end="8" resetval="0x0" description="Status shows the current divider value choosen for MMCSD" range="15:8" rwaccess="R"/>
	<bitfield id="MSS_MMCSD_CLK_STATUS_CLKINUSE" width="8" begin="7" end="0" resetval="0x1" description="Status shows the source clock slected for MMCSD based on one hot encoding technique." range="7:0" rwaccess="R"/>
	</register><register id="MSS_RCM_PRU_ICSS_UCLK_CLK_STATUS" acronym="MSS_RCM_PRU_ICSS_UCLK_CLK_STATUS" offset="1108" width="32" description="Clock source selection and Divider Value  of respective clock.">
		<bitfield id="PRU_ICSS_UCLK_CLK_STATUS_CURRDIVIDER" width="8" begin="15" end="8" resetval="0x0" description="Status shows the current divider value choosen for ICSSM_UCLK" range="15:8" rwaccess="R"/>
	<bitfield id="PRU_ICSS_UCLK_CLK_STATUS_CLKINUSE" width="8" begin="7" end="0" resetval="0x1" description="Status shows the source clock slected for ICSSM_UCLK based on one hot encoding technique." range="7:0" rwaccess="R"/>
	</register><register id="MSS_RCM_MSS_CPTS_CLK_STATUS" acronym="MSS_RCM_MSS_CPTS_CLK_STATUS" offset="1112" width="32" description="Clock source selection and Divider Value  of respective clock.">
		<bitfield id="MSS_CPTS_CLK_STATUS_CURRDIVIDER" width="8" begin="15" end="8" resetval="0x0" description="Status shows the current divider value choosen for CPTS" range="15:8" rwaccess="R"/>
	<bitfield id="MSS_CPTS_CLK_STATUS_CLKINUSE" width="8" begin="7" end="0" resetval="0x1" description="Status shows the source clock slected for CPTS based on one hot encoding technique." range="7:0" rwaccess="R"/>
	</register><register id="MSS_RCM_GPMC_CLK_STATUS" acronym="MSS_RCM_GPMC_CLK_STATUS" offset="1116" width="32" description="Clock source selection and Divider Value  of respective clock.">
		<bitfield id="GPMC_CLK_STATUS_CURRDIVIDER" width="8" begin="15" end="8" resetval="0x0" description="Status shows the current divider value choosen for GPMC" range="15:8" rwaccess="R"/>
	<bitfield id="GPMC_CLK_STATUS_CLKINUSE" width="8" begin="7" end="0" resetval="0x1" description="Status shows the source clock slected for GPMC based on one hot encoding technique." range="7:0" rwaccess="R"/>
	</register><register id="MSS_RCM_CONTROLSS_PLL_CLK_STATUS" acronym="MSS_RCM_CONTROLSS_PLL_CLK_STATUS" offset="1120" width="32" description="Clock source selection and Divider Value  of respective clock.">
		<bitfield id="CONTROLSS_PLL_CLK_STATUS_CURRDIVIDER" width="8" begin="15" end="8" resetval="0x0" description="Status shows the current divider value choosen for CONTROLSS_PLL" range="15:8" rwaccess="R"/>
	<bitfield id="CONTROLSS_PLL_CLK_STATUS_CLKINUSE" width="8" begin="7" end="0" resetval="0x1" description="Status shows the source clock slected for CONTROLSS_PLL based on one hot encoding technique." range="7:0" rwaccess="R"/>
	</register><register id="MSS_RCM_MSS_I2C_CLK_STATUS" acronym="MSS_RCM_MSS_I2C_CLK_STATUS" offset="1124" width="32" description="Clock source selection and Divider Value  of respective clock.">
		<bitfield id="MSS_I2C_CLK_STATUS_CURRDIVIDER" width="8" begin="15" end="8" resetval="0x0" description="Status shows the current divider value choosen for I2C" range="15:8" rwaccess="R"/>
	<bitfield id="MSS_I2C_CLK_STATUS_CLKINUSE" width="8" begin="7" end="0" resetval="0x1" description="Status shows the source clock slected for I2C based on one hot encoding technique." range="7:0" rwaccess="R"/>
	</register><register id="MSS_RCM_MSS_LIN0_UART0_CLK_STATUS" acronym="MSS_RCM_MSS_LIN0_UART0_CLK_STATUS" offset="1140" width="32" description="Clock source selection and Divider Value  of respective clock.">
		<bitfield id="MSS_LIN0_UART0_CLK_STATUS_CURRDIVIDER" width="8" begin="15" end="8" resetval="0x0" description="Status shows the current divider value choosen for  corresponding UART and LIN" range="15:8" rwaccess="R"/>
	<bitfield id="MSS_LIN0_UART0_CLK_STATUS_CLKINUSE" width="8" begin="7" end="0" resetval="0x1" description="Status shows the source clock slected for  corresponding UART and LIN based on one hot encoding technique." range="7:0" rwaccess="R"/>
	</register><register id="MSS_RCM_MSS_LIN1_UART1_CLK_STATUS" acronym="MSS_RCM_MSS_LIN1_UART1_CLK_STATUS" offset="1144" width="32" description="Clock source selection and Divider Value  of respective clock.">
		<bitfield id="MSS_LIN1_UART1_CLK_STATUS_CURRDIVIDER" width="8" begin="15" end="8" resetval="0x0" description="Status shows the current divider value choosen for  corresponding UART and LIN" range="15:8" rwaccess="R"/>
	<bitfield id="MSS_LIN1_UART1_CLK_STATUS_CLKINUSE" width="8" begin="7" end="0" resetval="0x1" description="Status shows the source clock slected for  corresponding UART and LIN based on one hot encoding technique." range="7:0" rwaccess="R"/>
	</register><register id="MSS_RCM_MSS_LIN2_UART2_CLK_STATUS" acronym="MSS_RCM_MSS_LIN2_UART2_CLK_STATUS" offset="1148" width="32" description="Clock source selection and Divider Value  of respective clock.">
		<bitfield id="MSS_LIN2_UART2_CLK_STATUS_CURRDIVIDER" width="8" begin="15" end="8" resetval="0x0" description="Status shows the current divider value choosen for  corresponding UART and LIN" range="15:8" rwaccess="R"/>
	<bitfield id="MSS_LIN2_UART2_CLK_STATUS_CLKINUSE" width="8" begin="7" end="0" resetval="0x1" description="Status shows the source clock slected for  corresponding UART and LIN based on one hot encoding technique." range="7:0" rwaccess="R"/>
	</register><register id="MSS_RCM_MSS_LIN3_UART3_CLK_STATUS" acronym="MSS_RCM_MSS_LIN3_UART3_CLK_STATUS" offset="1152" width="32" description="Clock source selection and Divider Value  of respective clock.">
		<bitfield id="MSS_LIN3_UART3_CLK_STATUS_CURRDIVIDER" width="8" begin="15" end="8" resetval="0x0" description="Status shows the current divider value choosen for  corresponding UART and LIN" range="15:8" rwaccess="R"/>
	<bitfield id="MSS_LIN3_UART3_CLK_STATUS_CLKINUSE" width="8" begin="7" end="0" resetval="0x1" description="Status shows the source clock slected for  corresponding UART and LIN based on one hot encoding technique." range="7:0" rwaccess="R"/>
	</register><register id="MSS_RCM_MSS_LIN4_UART4_CLK_STATUS" acronym="MSS_RCM_MSS_LIN4_UART4_CLK_STATUS" offset="1156" width="32" description="Clock source selection and Divider Value  of respective clock.">
		<bitfield id="MSS_LIN4_UART4_CLK_STATUS_CURRDIVIDER" width="8" begin="15" end="8" resetval="0x0" description="Status shows the current divider value choosen for  corresponding UART and LIN" range="15:8" rwaccess="R"/>
	<bitfield id="MSS_LIN4_UART4_CLK_STATUS_CLKINUSE" width="8" begin="7" end="0" resetval="0x1" description="Status shows the source clock slected for  corresponding UART and LIN based on one hot encoding technique." range="7:0" rwaccess="R"/>
	</register><register id="MSS_RCM_MSS_LIN5_UART5_CLK_STATUS" acronym="MSS_RCM_MSS_LIN5_UART5_CLK_STATUS" offset="1160" width="32" description="Clock source selection and Divider Value  of respective clock.">
		<bitfield id="MSS_LIN5_UART5_CLK_STATUS_CURRDIVIDER" width="8" begin="15" end="8" resetval="0x0" description="Status shows the current divider value choosen for  corresponding UART and LIN" range="15:8" rwaccess="R"/>
	<bitfield id="MSS_LIN5_UART5_CLK_STATUS_CLKINUSE" width="8" begin="7" end="0" resetval="0x1" description="Status shows the source clock slected for  corresponding UART and LIN based on one hot encoding technique." range="7:0" rwaccess="R"/>
	</register><register id="MSS_RCM_MSS_RGMII_CLK_STATUS" acronym="MSS_RCM_MSS_RGMII_CLK_STATUS" offset="1164" width="32" description="Clock source selection and Divider Value  of respective clock.">
		<bitfield id="MSS_RGMII_CLK_STATUS_CURRDIVIDER" width="8" begin="15" end="8" resetval="0x1" description="Status shows the current divider value choosen for RGMII" range="15:8" rwaccess="R"/>
	</register><register id="MSS_RCM_MSS_MII100_CLK_STATUS" acronym="MSS_RCM_MSS_MII100_CLK_STATUS" offset="1168" width="32" description="RGMII_50_CLK_STATUS.">
		<bitfield id="MSS_MII100_CLK_STATUS_CURRDIVIDER" width="8" begin="15" end="8" resetval="0x9" description="Status shows the current divider value choosen for MII100" range="15:8" rwaccess="R"/>
	</register><register id="MSS_RCM_MSS_MII10_CLK_STATUS" acronym="MSS_RCM_MSS_MII10_CLK_STATUS" offset="1172" width="32" description="RGMII_5_CLK_STATUS.">
		<bitfield id="MSS_MII10_CLK_STATUS_CURRDIVIDER" width="8" begin="15" end="8" resetval="0x99" description="Status shows the current divider value choosen for MII10" range="15:8" rwaccess="R"/>
	</register><register id="MSS_RCM_MMC0_32K_CLK_STATUS" acronym="MSS_RCM_MMC0_32K_CLK_STATUS" offset="1180" width="32" description="Clock source selection and Divider Value  of respective clock.">
		<bitfield id="MMC0_32K_CLK_STATUS_CURRDIVIDER" width="10" begin="17" end="8" resetval="0x780" description="Status shows the current divider value choosen for XTAL_32K" range="17:8" rwaccess="R"/>
	</register><register id="MSS_RCM_TEMPSENSE_32K_CLK_STATUS" acronym="MSS_RCM_TEMPSENSE_32K_CLK_STATUS" offset="1184" width="32" description="Clock source selection and Divider Value  of respective clock.">
		<bitfield id="TEMPSENSE_32K_CLK_STATUS_CURRDIVIDER" width="10" begin="17" end="8" resetval="0x780" description="Status shows the current divider value choosen for XTAL_32K" range="17:8" rwaccess="R"/>
	</register><register id="MSS_RCM_MSS_ELM_CLK_STATUS" acronym="MSS_RCM_MSS_ELM_CLK_STATUS" offset="1188" width="32" description="MSS_ELM_CLK_STATUS.">
