ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/AM263X/MSS_RCM_MSS_RCM_53208000h.xml
		<bitfield id="MSS_ELM_CLK_STATUS_CURRDIVIDER" width="8" begin="15" end="8" resetval="0x3" description="Status shows the current divider value choosen for ELM" range="15:8" rwaccess="R"/>
	</register><register id="MSS_RCM_MSS_R5SS0_POR_RST_CTRL0" acronym="MSS_RCM_MSS_R5SS0_POR_RST_CTRL0" offset="1280" width="32" description="This register is used to Reset respective IP.">
		<bitfield id="MSS_CR5SS_POR_RST_CTRL0_ASSERT" width="3" begin="2" end="0" resetval="0x0" description="This feature is for debug purpose only. Software needs to ensure the state of the Device/IP before configuring.write pulse bit field:Writing 3'b111 will assert por reset to R5SS Read is always 000" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MSS_R5SS0_POR_RST_CTRL1" acronym="MSS_RCM_MSS_R5SS0_POR_RST_CTRL1" offset="1284" width="32" description="R5SS POR Reset.">
		<bitfield id="MSS_CR5SS_POR_RST_CTRL1_ASSERT" width="3" begin="2" end="0" resetval="0x0" description="This feature is for debug purpose only. Software needs to ensure the state of the Device/IP before configuring.write pulse bit field:Writing 3'b111 will assert por reset to R5SS Read is always 000" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MSS_CR5SSA_RST_CTRL0" acronym="MSS_RCM_MSS_CR5SSA_RST_CTRL0" offset="1288" width="32" description="R5SS POR Reset.">
		<bitfield id="MSS_CR5SSA_RST_CTRL0_ASSERT" width="3" begin="2" end="0" resetval="0x0" description="This feature is for debug purpose only. Software needs to ensure the state of the Device/IP before configuring.write pulse bit field:Writing 3'b111  will reset CORE0 and MSS_CORE0_VIM" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MSS_CR5SSA_RST_CTRL1" acronym="MSS_RCM_MSS_CR5SSA_RST_CTRL1" offset="1292" width="32" description="Core 0 Global Reset.">
		<bitfield id="MSS_CR5SSA_RST_CTRL1_ASSERT" width="3" begin="2" end="0" resetval="0x0" description="This feature is for debug purpose only. Software needs to ensure the state of the Device/IP before configuring.write pulse bit field:Writing 3'b111  will reset CORE0 and MSS_CORE0_VIM" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MSS_CR5SSB_RST_CTRL0" acronym="MSS_RCM_MSS_CR5SSB_RST_CTRL0" offset="1296" width="32" description="Core 0 Global Reset.">
		<bitfield id="MSS_CR5SSB_RST_CTRL0_ASSERT" width="3" begin="2" end="0" resetval="0x0" description="This feature is for debug purpose only. Software needs to ensure the state of the Device/IP before configuring.write pulse bit field:Writing 3'b111  will reset CORE1  and MSS_CORE1_VIM" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MSS_CR5SSB_RST_CTRL1" acronym="MSS_RCM_MSS_CR5SSB_RST_CTRL1" offset="1300" width="32" description="Core 1 Global Reset.">
		<bitfield id="MSS_CR5SSB_RST_CTRL1_ASSERT" width="3" begin="2" end="0" resetval="0x0" description="This feature is for debug purpose only. Software needs to ensure the state of the Device/IP before configuring.write pulse bit field:Writing 3'b111  will reset CORE1  and MSS_CORE1_VIM" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MSS_R5SS0_CORE0_RST_CTRL0" acronym="MSS_RCM_MSS_R5SS0_CORE0_RST_CTRL0" offset="1304" width="32" description="Core 1 Global Reset.">
		<bitfield id="MSS_CR5A_RST_CTRL0_ASSERT" width="3" begin="2" end="0" resetval="0x0" description="This feature is for debug purpose only. Software needs to ensure the state of the Device/IP before configuring.write pulse bit field:Writing 3'b111  will reset CORE0 only" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MSS_R5SS0_CORE0_RST_CTRL1" acronym="MSS_RCM_MSS_R5SS0_CORE0_RST_CTRL1" offset="1308" width="32" description="Core 0 Local  Reset.">
		<bitfield id="MSS_CR5A_RST_CTRL1_ASSERT" width="3" begin="2" end="0" resetval="0x0" description="This feature is for debug purpose only. Software needs to ensure the state of the Device/IP before configuring.write pulse bit field:Writing 3'b111  will reset CORE0 only" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MSS_R5SS0_CORE1_RST_CTRL0" acronym="MSS_RCM_MSS_R5SS0_CORE1_RST_CTRL0" offset="1312" width="32" description="Core 0 Local  Reset.">
		<bitfield id="MSS_CR5B_RST_CTRL0_ASSERT" width="3" begin="2" end="0" resetval="0x0" description="This feature is for debug purpose only. Software needs to ensure the state of the Device/IP before configuring.write pulse bit field:Writing 3'b111  will reset CORE1 only" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MSS_R5SS0_CORE1_RST_CTRL1" acronym="MSS_RCM_MSS_R5SS0_CORE1_RST_CTRL1" offset="1316" width="32" description="Core 1 Local  Reset.">
		<bitfield id="MSS_CR5B_RST_CTRL1_ASSERT" width="3" begin="2" end="0" resetval="0x0" description="This feature is for debug purpose only. Software needs to ensure the state of the Device/IP before configuring.write pulse bit field:Writing 3'b111  will reset CORE1 only" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MSS_VIMA_RST_CTRL0" acronym="MSS_RCM_MSS_VIMA_RST_CTRL0" offset="1320" width="32" description="Core 1 Local  Reset.">
		<bitfield id="MSS_VIMA_RST_CTRL0_ASSERT" width="3" begin="2" end="0" resetval="0x0" description="This feature is for debug purpose only. Software needs to ensure the state of the Device/IP before configuring. Writing  3'b111  will reset MSS_CORE0_VIM Writing 3'b000 will deassert the reset" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MSS_VIMA_RST_CTRL1" acronym="MSS_RCM_MSS_VIMA_RST_CTRL1" offset="1324" width="32" description="This register is used to Reset respective IP.">
		<bitfield id="MSS_VIMA_RST_CTRL1_ASSERT" width="3" begin="2" end="0" resetval="0x0" description="This feature is for debug purpose only. Software needs to ensure the state of the Device/IP before configuring. Writing  3'b111  will reset MSS_CORE0_VIM Writing 3'b000 will deassert the reset" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MSS_VIMB_RST_CTRL0" acronym="MSS_RCM_MSS_VIMB_RST_CTRL0" offset="1328" width="32" description="This register is used to Reset respective IP.">
		<bitfield id="MSS_VIMB_RST_CTRL0_ASSERT" width="3" begin="2" end="0" resetval="0x0" description="This feature is for debug purpose only. Software needs to ensure the state of the Device/IP before configuring. Writing  3'b111  will reset MSS_CORE1_VIM" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MSS_VIMB_RST_CTRL1" acronym="MSS_RCM_MSS_VIMB_RST_CTRL1" offset="1332" width="32" description="This register is used to Reset respective IP.">
		<bitfield id="MSS_VIMB_RST_CTRL1_ASSERT" width="3" begin="2" end="0" resetval="0x0" description="This feature is for debug purpose only. Software needs to ensure the state of the Device/IP before configuring. Writing  3'b111  will reset MSS_CORE1_VIM" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MSS_CRC_RST_CTRL" acronym="MSS_RCM_MSS_CRC_RST_CTRL" offset="1336" width="32" description="This register is used to Reset respective IP.">
		<bitfield id="MSS_CRC_RST_CTRL_ASSERT" width="3" begin="2" end="0" resetval="0x0" description="This feature is for debug purpose only. Software needs to ensure the state of the Device/IP before configuring. Writing  3'b111  will reset MCRC" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MSS_RTI0_RST_CTRL" acronym="MSS_RCM_MSS_RTI0_RST_CTRL" offset="1340" width="32" description="This register is used to Reset respective IP.">
		<bitfield id="MSS_RTI0_RST_CTRL_ASSERT" width="3" begin="2" end="0" resetval="0x0" description="This feature is for debug purpose only. Software needs to ensure the state of the Device/IP before configuring. Writing  3'b111  will reset corresponding RTI" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MSS_RTI1_RST_CTRL" acronym="MSS_RCM_MSS_RTI1_RST_CTRL" offset="1344" width="32" description="This register is used to Reset respective IP.">
		<bitfield id="MSS_RTI1_RST_CTRL_ASSERT" width="3" begin="2" end="0" resetval="0x0" description="This feature is for debug purpose only. Software needs to ensure the state of the Device/IP before configuring. Writing  3'b111  will reset corresponding RTI" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MSS_RTI2_RST_CTRL" acronym="MSS_RCM_MSS_RTI2_RST_CTRL" offset="1348" width="32" description="This register is used to Reset respective IP.">
		<bitfield id="MSS_RTI2_RST_CTRL_ASSERT" width="3" begin="2" end="0" resetval="0x0" description="This feature is for debug purpose only. Software needs to ensure the state of the Device/IP before configuring. Writing  3'b111  will reset corresponding RTI" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MSS_RTI3_RST_CTRL" acronym="MSS_RCM_MSS_RTI3_RST_CTRL" offset="1352" width="32" description="This register is used to Reset respective IP.">
		<bitfield id="MSS_RTI3_RST_CTRL_ASSERT" width="3" begin="2" end="0" resetval="0x0" description="This feature is for debug purpose only. Software needs to ensure the state of the Device/IP before configuring. Writing  3'b111  will reset corresponding RTI" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MSS_WDT0_RST_CTRL" acronym="MSS_RCM_MSS_WDT0_RST_CTRL" offset="1356" width="32" description="This register is used to Reset respective IP.">
		<bitfield id="MSS_WDT0_RST_CTRL_ASSERT" width="3" begin="2" end="0" resetval="0x0" description="This feature is for debug purpose only. Software needs to ensure the state of the Device/IP before configuring. Writing  3'b111  will reset corresponding WDT" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MSS_WDT1_RST_CTRL" acronym="MSS_RCM_MSS_WDT1_RST_CTRL" offset="1360" width="32" description="This register is used to Reset respective IP.">
		<bitfield id="MSS_WDT1_RST_CTRL_ASSERT" width="3" begin="2" end="0" resetval="0x0" description="This feature is for debug purpose only. Software needs to ensure the state of the Device/IP before configuring. Writing  3'b111  will reset corresponding WDT" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MSS_WDT2_RST_CTRL" acronym="MSS_RCM_MSS_WDT2_RST_CTRL" offset="1364" width="32" description="This register is used to Reset respective IP.">
		<bitfield id="MSS_WDT2_RST_CTRL_ASSERT" width="3" begin="2" end="0" resetval="0x0" description="This feature is for debug purpose only. Software needs to ensure the state of the Device/IP before configuring. Writing  3'b111  will reset corresponding WDT" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MSS_WDT3_RST_CTRL" acronym="MSS_RCM_MSS_WDT3_RST_CTRL" offset="1368" width="32" description="This register is used to Reset respective IP.">
		<bitfield id="MSS_WDT3_RST_CTRL_ASSERT" width="3" begin="2" end="0" resetval="0x0" description="This feature is for debug purpose only. Software needs to ensure the state of the Device/IP before configuring. Writing  3'b111  will reset corresponding WDT" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MSS_ESM_RST_CTRL" acronym="MSS_RCM_MSS_ESM_RST_CTRL" offset="1372" width="32" description="This register is used to Reset respective IP.">
		<bitfield id="MSS_ESM_RST_CTRL_ASSERT" width="3" begin="2" end="0" resetval="0x0" description="This feature is for debug purpose only. Software needs to ensure the state of the Device/IP before configuring. Writing  3'b111  will reset ESM" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MSS_DCC0_RST_CTRL" acronym="MSS_RCM_MSS_DCC0_RST_CTRL" offset="1376" width="32" description="This register is used to Reset respective IP.">
		<bitfield id="MSS_DCC0_RST_CTRL_ASSERT" width="3" begin="2" end="0" resetval="0x0" description="This feature is for debug purpose only. Software needs to ensure the state of the Device/IP before configuring. Writing  3'b111  will reset DCC1" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MSS_DCC1_RST_CTRL" acronym="MSS_RCM_MSS_DCC1_RST_CTRL" offset="1380" width="32" description="This register is used to Reset respective IP.">
		<bitfield id="MSS_DCC1_RST_CTRL_ASSERT" width="3" begin="2" end="0" resetval="0x0" description="This feature is for debug purpose only. Software needs to ensure the state of the Device/IP before configuring. Writing  3'b111  will reset DCC2" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MSS_DCC2_RST_CTRL" acronym="MSS_RCM_MSS_DCC2_RST_CTRL" offset="1384" width="32" description="This register is used to Reset respective IP.">
		<bitfield id="MSS_DCC2_RST_CTRL_ASSERT" width="3" begin="2" end="0" resetval="0x0" description="This feature is for debug purpose only. Software needs to ensure the state of the Device/IP before configuring. Writing  3'b111  will reset DCC3" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MSS_DCC3_RST_CTRL" acronym="MSS_RCM_MSS_DCC3_RST_CTRL" offset="1388" width="32" description="This register is used to Reset respective IP.">
		<bitfield id="MSS_DCC3_RST_CTRL_ASSERT" width="3" begin="2" end="0" resetval="0x0" description="This feature is for debug purpose only. Software needs to ensure the state of the Device/IP before configuring. Writing  3'b111  will reset DCC4" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MSS_SPI0_RST_CTRL" acronym="MSS_RCM_MSS_SPI0_RST_CTRL" offset="1392" width="32" description="This register is used to Reset respective IP.">
		<bitfield id="MSS_SPI0_RST_CTRL_ASSERT" width="3" begin="2" end="0" resetval="0x0" description="This feature is for debug purpose only. Software needs to ensure the state of the Device/IP before configuring. Writing  3'b111  will reset Corresponding SPI" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MSS_SPI1_RST_CTRL" acronym="MSS_RCM_MSS_SPI1_RST_CTRL" offset="1396" width="32" description="This register is used to Reset respective IP.">
		<bitfield id="MSS_SPI1_RST_CTRL_ASSERT" width="3" begin="2" end="0" resetval="0x0" description="This feature is for debug purpose only. Software needs to ensure the state of the Device/IP before configuring. Writing  3'b111  will reset Corresponding SPI" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MSS_SPI2_RST_CTRL" acronym="MSS_RCM_MSS_SPI2_RST_CTRL" offset="1400" width="32" description="This register is used to Reset respective IP.">
		<bitfield id="MSS_SPI2_RST_CTRL_ASSERT" width="3" begin="2" end="0" resetval="0x0" description="This feature is for debug purpose only. Software needs to ensure the state of the Device/IP before configuring. Writing  3'b111  will reset Corresponding SPI" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MSS_SPI3_RST_CTRL" acronym="MSS_RCM_MSS_SPI3_RST_CTRL" offset="1404" width="32" description="This register is used to Reset respective IP.">
		<bitfield id="MSS_SPI3_RST_CTRL_ASSERT" width="3" begin="2" end="0" resetval="0x0" description="This feature is for debug purpose only. Software needs to ensure the state of the Device/IP before configuring. Writing  3'b111  will reset Corresponding SPI" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MSS_SPI4_RST_CTRL" acronym="MSS_RCM_MSS_SPI4_RST_CTRL" offset="1408" width="32" description="This register is used to Reset respective IP.">
		<bitfield id="MSS_SPI4_RST_CTRL_ASSERT" width="3" begin="2" end="0" resetval="0x0" description="This feature is for debug purpose only. Software needs to ensure the state of the Device/IP before configuring. Writing  3'b111  will reset Corresponding SPI" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MSS_QSPI_RST_CTRL" acronym="MSS_RCM_MSS_QSPI_RST_CTRL" offset="1412" width="32" description="This register is used to Reset respective IP.">
		<bitfield id="MSS_QSPI_RST_CTRL_ASSERT" width="3" begin="2" end="0" resetval="0x0" description="This feature is for debug purpose only. Software needs to ensure the state of the Device/IP before configuring. Writing  3'b111  will reset QSPI" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MSS_MCAN0_RST_CTRL" acronym="MSS_RCM_MSS_MCAN0_RST_CTRL" offset="1416" width="32" description="This register is used to Reset respective IP.">
		<bitfield id="MSS_MCAN0_RST_CTRL_ASSERT" width="3" begin="2" end="0" resetval="0x0" description="This feature is for debug purpose only. Software needs to ensure the state of the Device/IP before configuring. Writing  3'b111  will reset corresponding MCAN" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MSS_MCAN1_RST_CTRL" acronym="MSS_RCM_MSS_MCAN1_RST_CTRL" offset="1420" width="32" description="This register is used to Reset respective IP.">
		<bitfield id="MSS_MCAN1_RST_CTRL_ASSERT" width="3" begin="2" end="0" resetval="0x0" description="This feature is for debug purpose only. Software needs to ensure the state of the Device/IP before configuring. Writing  3'b111  will reset corresponding MCAN" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MSS_MCAN2_RST_CTRL" acronym="MSS_RCM_MSS_MCAN2_RST_CTRL" offset="1424" width="32" description="This register is used to Reset respective IP.">
		<bitfield id="MSS_MCAN2_RST_CTRL_ASSERT" width="3" begin="2" end="0" resetval="0x0" description="This feature is for debug purpose only. Software needs to ensure the state of the Device/IP before configuring. Writing  3'b111  will reset corresponding MCAN" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MSS_MCAN3_RST_CTRL" acronym="MSS_RCM_MSS_MCAN3_RST_CTRL" offset="1428" width="32" description="This register is used to Reset respective IP.">
		<bitfield id="MSS_MCAN3_RST_CTRL_ASSERT" width="3" begin="2" end="0" resetval="0x0" description="This feature is for debug purpose only. Software needs to ensure the state of the Device/IP before configuring. Writing  3'b111  will reset corresponding MCAN" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MSS_I2C0_RST_CTRL" acronym="MSS_RCM_MSS_I2C0_RST_CTRL" offset="1432" width="32" description="This register is used to Reset respective IP.">
		<bitfield id="MSS_I2C0_RST_CTRL_ASSERT" width="3" begin="2" end="0" resetval="0x0" description="This feature is for debug purpose only. Software needs to ensure the state of the Device/IP before configuring. Writing  3'b111  will reset corresponding I2C" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MSS_I2C1_RST_CTRL" acronym="MSS_RCM_MSS_I2C1_RST_CTRL" offset="1436" width="32" description="This register is used to Reset respective IP.">
		<bitfield id="MSS_I2C1_RST_CTRL_ASSERT" width="3" begin="2" end="0" resetval="0x0" description="This feature is for debug purpose only. Software needs to ensure the state of the Device/IP before configuring. Writing  3'b111  will reset corresponding I2C" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MSS_I2C2_RST_CTRL" acronym="MSS_RCM_MSS_I2C2_RST_CTRL" offset="1440" width="32" description="This register is used to Reset respective IP.">
		<bitfield id="MSS_I2C2_RST_CTRL_ASSERT" width="3" begin="2" end="0" resetval="0x0" description="This feature is for debug purpose only. Software needs to ensure the state of the Device/IP before configuring. Writing  3'b111  will reset corresponding I2C" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MSS_I2C3_RST_CTRL" acronym="MSS_RCM_MSS_I2C3_RST_CTRL" offset="1444" width="32" description="This register is used to Reset respective IP.">
		<bitfield id="MSS_I2C3_RST_CTRL_ASSERT" width="3" begin="2" end="0" resetval="0x0" description="This feature is for debug purpose only. Software needs to ensure the state of the Device/IP before configuring. Writing  3'b111  will reset corresponding I2C" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MSS_UART0_RST_CTRL" acronym="MSS_RCM_MSS_UART0_RST_CTRL" offset="1448" width="32" description="This register is used to Reset respective IP.">
		<bitfield id="MSS_UART0_RST_CTRL_ASSERT" width="3" begin="2" end="0" resetval="0x0" description="This feature is for debug purpose only. Software needs to ensure the state of the Device/IP before configuring. Writing  3'b111  will reset corresponding UART instance" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MSS_UART1_RST_CTRL" acronym="MSS_RCM_MSS_UART1_RST_CTRL" offset="1452" width="32" description="This register is used to Reset respective IP.">
		<bitfield id="MSS_UART1_RST_CTRL_ASSERT" width="3" begin="2" end="0" resetval="0x0" description="This feature is for debug purpose only. Software needs to ensure the state of the Device/IP before configuring. Writing  3'b111  will reset corresponding UART instance" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MSS_UART2_RST_CTRL" acronym="MSS_RCM_MSS_UART2_RST_CTRL" offset="1456" width="32" description="This register is used to Reset respective IP.">
		<bitfield id="MSS_UART2_RST_CTRL_ASSERT" width="3" begin="2" end="0" resetval="0x0" description="This feature is for debug purpose only. Software needs to ensure the state of the Device/IP before configuring. Writing  3'b111  will reset corresponding UART instance" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MSS_UART3_RST_CTRL" acronym="MSS_RCM_MSS_UART3_RST_CTRL" offset="1460" width="32" description="This register is used to Reset respective IP.">
		<bitfield id="MSS_UART3_RST_CTRL_ASSERT" width="3" begin="2" end="0" resetval="0x0" description="This feature is for debug purpose only. Software needs to ensure the state of the Device/IP before configuring. Writing  3'b111  will reset corresponding UART instance" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MSS_UART4_RST_CTRL" acronym="MSS_RCM_MSS_UART4_RST_CTRL" offset="1464" width="32" description="This register is used to Reset respective IP.">
		<bitfield id="MSS_UART4_RST_CTRL_ASSERT" width="3" begin="2" end="0" resetval="0x0" description="This feature is for debug purpose only. Software needs to ensure the state of the Device/IP before configuring. Writing  3'b111  will reset corresponding UART instance" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MSS_UART5_RST_CTRL" acronym="MSS_RCM_MSS_UART5_RST_CTRL" offset="1468" width="32" description="This register is used to Reset respective IP.">
		<bitfield id="MSS_UART5_RST_CTRL_ASSERT" width="3" begin="2" end="0" resetval="0x0" description="This feature is for debug purpose only. Software needs to ensure the state of the Device/IP before configuring. Writing  3'b111  will reset corresponding UART instance" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MSS_LIN0_RST_CTRL" acronym="MSS_RCM_MSS_LIN0_RST_CTRL" offset="1472" width="32" description="This register is used to Reset respective IP.">
		<bitfield id="MSS_LIN0_RST_CTRL_ASSERT" width="3" begin="2" end="0" resetval="0x0" description="This feature is for debug purpose only. Software needs to ensure the state of the Device/IP before configuring. Writing  3'b111  will reset corresponding LIN" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MSS_LIN1_RST_CTRL" acronym="MSS_RCM_MSS_LIN1_RST_CTRL" offset="1476" width="32" description="This register is used to Reset respective IP.">
		<bitfield id="MSS_LIN1_RST_CTRL_ASSERT" width="3" begin="2" end="0" resetval="0x0" description="This feature is for debug purpose only. Software needs to ensure the state of the Device/IP before configuring. Writing  3'b111  will reset corresponding LIN" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MSS_LIN2_RST_CTRL" acronym="MSS_RCM_MSS_LIN2_RST_CTRL" offset="1480" width="32" description="This register is used to Reset respective IP.">
		<bitfield id="MSS_LIN2_RST_CTRL_ASSERT" width="3" begin="2" end="0" resetval="0x0" description="This feature is for debug purpose only. Software needs to ensure the state of the Device/IP before configuring. Writing  3'b111  will reset corresponding LIN" range="2:0" rwaccess="R/W"/>
